// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct asn_bit_outp_s {
 *     uint8_t *buffer;
 *     size_t nboff;
 *     size_t nbits;
 *     uint8_t tmpspace[32];
 *     int (*output)(const void *, size_t, void *);
 *     void *op_key;
 *     size_t flushed_bytes;
 * }
 * }
 */
public class asn_bit_outp_s {

    asn_bit_outp_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_POINTER.withName("buffer"),
        MessageFrame_h.C_LONG.withName("nboff"),
        MessageFrame_h.C_LONG.withName("nbits"),
        MemoryLayout.sequenceLayout(32, MessageFrame_h.C_CHAR).withName("tmpspace"),
        MessageFrame_h.C_POINTER.withName("output"),
        MessageFrame_h.C_POINTER.withName("op_key"),
        MessageFrame_h.C_LONG.withName("flushed_bytes")
    ).withName("asn_bit_outp_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout buffer$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("buffer"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static final AddressLayout buffer$layout() {
        return buffer$LAYOUT;
    }

    private static final long buffer$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static final long buffer$offset() {
        return buffer$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static MemorySegment buffer(MemorySegment struct) {
        return struct.get(buffer$LAYOUT, buffer$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t *buffer
     * }
     */
    public static void buffer(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(buffer$LAYOUT, buffer$OFFSET, fieldValue);
    }

    private static final OfLong nboff$LAYOUT = (OfLong)$LAYOUT.select(groupElement("nboff"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t nboff
     * }
     */
    public static final OfLong nboff$layout() {
        return nboff$LAYOUT;
    }

    private static final long nboff$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t nboff
     * }
     */
    public static final long nboff$offset() {
        return nboff$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t nboff
     * }
     */
    public static long nboff(MemorySegment struct) {
        return struct.get(nboff$LAYOUT, nboff$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t nboff
     * }
     */
    public static void nboff(MemorySegment struct, long fieldValue) {
        struct.set(nboff$LAYOUT, nboff$OFFSET, fieldValue);
    }

    private static final OfLong nbits$LAYOUT = (OfLong)$LAYOUT.select(groupElement("nbits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t nbits
     * }
     */
    public static final OfLong nbits$layout() {
        return nbits$LAYOUT;
    }

    private static final long nbits$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t nbits
     * }
     */
    public static final long nbits$offset() {
        return nbits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t nbits
     * }
     */
    public static long nbits(MemorySegment struct) {
        return struct.get(nbits$LAYOUT, nbits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t nbits
     * }
     */
    public static void nbits(MemorySegment struct, long fieldValue) {
        struct.set(nbits$LAYOUT, nbits$OFFSET, fieldValue);
    }

    private static final SequenceLayout tmpspace$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("tmpspace"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static final SequenceLayout tmpspace$layout() {
        return tmpspace$LAYOUT;
    }

    private static final long tmpspace$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static final long tmpspace$offset() {
        return tmpspace$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static MemorySegment tmpspace(MemorySegment struct) {
        return struct.asSlice(tmpspace$OFFSET, tmpspace$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static void tmpspace(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, tmpspace$OFFSET, tmpspace$LAYOUT.byteSize());
    }

    private static long[] tmpspace$DIMS = { 32 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static long[] tmpspace$dimensions() {
        return tmpspace$DIMS;
    }
    private static final VarHandle tmpspace$ELEM_HANDLE = tmpspace$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static byte tmpspace(MemorySegment struct, long index0) {
        return (byte)tmpspace$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * uint8_t tmpspace[32]
     * }
     */
    public static void tmpspace(MemorySegment struct, long index0, byte fieldValue) {
        tmpspace$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * int (*output)(const void *, size_t, void *)
     * }
     */
    public static class output {

        output() {
            // Should not be called directly
        }

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            int apply(MemorySegment _x0, long _x1, MemorySegment _x2);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.of(
            MessageFrame_h.C_INT,
            MessageFrame_h.C_POINTER,
            MessageFrame_h.C_LONG,
            MessageFrame_h.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = MessageFrame_h.upcallHandle(Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static int invoke(MemorySegment funcPtr,MemorySegment _x0, long _x1, MemorySegment _x2) {
            try {
                return (int) DOWN$MH.invokeExact(funcPtr, _x0, _x1, _x2);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout output$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("output"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int (*output)(const void *, size_t, void *)
     * }
     */
    public static final AddressLayout output$layout() {
        return output$LAYOUT;
    }

    private static final long output$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int (*output)(const void *, size_t, void *)
     * }
     */
    public static final long output$offset() {
        return output$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int (*output)(const void *, size_t, void *)
     * }
     */
    public static MemorySegment output(MemorySegment struct) {
        return struct.get(output$LAYOUT, output$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int (*output)(const void *, size_t, void *)
     * }
     */
    public static void output(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(output$LAYOUT, output$OFFSET, fieldValue);
    }

    private static final AddressLayout op_key$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("op_key"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *op_key
     * }
     */
    public static final AddressLayout op_key$layout() {
        return op_key$LAYOUT;
    }

    private static final long op_key$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *op_key
     * }
     */
    public static final long op_key$offset() {
        return op_key$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *op_key
     * }
     */
    public static MemorySegment op_key(MemorySegment struct) {
        return struct.get(op_key$LAYOUT, op_key$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *op_key
     * }
     */
    public static void op_key(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(op_key$LAYOUT, op_key$OFFSET, fieldValue);
    }

    private static final OfLong flushed_bytes$LAYOUT = (OfLong)$LAYOUT.select(groupElement("flushed_bytes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t flushed_bytes
     * }
     */
    public static final OfLong flushed_bytes$layout() {
        return flushed_bytes$LAYOUT;
    }

    private static final long flushed_bytes$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t flushed_bytes
     * }
     */
    public static final long flushed_bytes$offset() {
        return flushed_bytes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t flushed_bytes
     * }
     */
    public static long flushed_bytes(MemorySegment struct) {
        return struct.get(flushed_bytes$LAYOUT, flushed_bytes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t flushed_bytes
     * }
     */
    public static void flushed_bytes(MemorySegment struct, long fieldValue) {
        struct.set(flushed_bytes$LAYOUT, flushed_bytes$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

