// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct AxesMovement {
 *     Yaw_t *yaw;
 *     Pitch_t *pitch;
 *     Roll_t *roll;
 *     YawRate_t *yawRate;
 *     CooperativeControlMessage_PitchRate_t *pitchRate;
 *     CooperativeControlMessage_RollRate_t *rollRate;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class AxesMovement {

    AxesMovement() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_POINTER.withName("yaw"),
        MessageFrame_h.C_POINTER.withName("pitch"),
        MessageFrame_h.C_POINTER.withName("roll"),
        MessageFrame_h.C_POINTER.withName("yawRate"),
        MessageFrame_h.C_POINTER.withName("pitchRate"),
        MessageFrame_h.C_POINTER.withName("rollRate"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("AxesMovement");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout yaw$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("yaw"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Yaw_t *yaw
     * }
     */
    public static final AddressLayout yaw$layout() {
        return yaw$LAYOUT;
    }

    private static final long yaw$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Yaw_t *yaw
     * }
     */
    public static final long yaw$offset() {
        return yaw$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Yaw_t *yaw
     * }
     */
    public static MemorySegment yaw(MemorySegment struct) {
        return struct.get(yaw$LAYOUT, yaw$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Yaw_t *yaw
     * }
     */
    public static void yaw(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(yaw$LAYOUT, yaw$OFFSET, fieldValue);
    }

    private static final AddressLayout pitch$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pitch"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Pitch_t *pitch
     * }
     */
    public static final AddressLayout pitch$layout() {
        return pitch$LAYOUT;
    }

    private static final long pitch$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Pitch_t *pitch
     * }
     */
    public static final long pitch$offset() {
        return pitch$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Pitch_t *pitch
     * }
     */
    public static MemorySegment pitch(MemorySegment struct) {
        return struct.get(pitch$LAYOUT, pitch$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Pitch_t *pitch
     * }
     */
    public static void pitch(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pitch$LAYOUT, pitch$OFFSET, fieldValue);
    }

    private static final AddressLayout roll$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("roll"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Roll_t *roll
     * }
     */
    public static final AddressLayout roll$layout() {
        return roll$LAYOUT;
    }

    private static final long roll$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Roll_t *roll
     * }
     */
    public static final long roll$offset() {
        return roll$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Roll_t *roll
     * }
     */
    public static MemorySegment roll(MemorySegment struct) {
        return struct.get(roll$LAYOUT, roll$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Roll_t *roll
     * }
     */
    public static void roll(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(roll$LAYOUT, roll$OFFSET, fieldValue);
    }

    private static final AddressLayout yawRate$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("yawRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * YawRate_t *yawRate
     * }
     */
    public static final AddressLayout yawRate$layout() {
        return yawRate$LAYOUT;
    }

    private static final long yawRate$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * YawRate_t *yawRate
     * }
     */
    public static final long yawRate$offset() {
        return yawRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * YawRate_t *yawRate
     * }
     */
    public static MemorySegment yawRate(MemorySegment struct) {
        return struct.get(yawRate$LAYOUT, yawRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * YawRate_t *yawRate
     * }
     */
    public static void yawRate(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(yawRate$LAYOUT, yawRate$OFFSET, fieldValue);
    }

    private static final AddressLayout pitchRate$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pitchRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_PitchRate_t *pitchRate
     * }
     */
    public static final AddressLayout pitchRate$layout() {
        return pitchRate$LAYOUT;
    }

    private static final long pitchRate$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_PitchRate_t *pitchRate
     * }
     */
    public static final long pitchRate$offset() {
        return pitchRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_PitchRate_t *pitchRate
     * }
     */
    public static MemorySegment pitchRate(MemorySegment struct) {
        return struct.get(pitchRate$LAYOUT, pitchRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_PitchRate_t *pitchRate
     * }
     */
    public static void pitchRate(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pitchRate$LAYOUT, pitchRate$OFFSET, fieldValue);
    }

    private static final AddressLayout rollRate$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rollRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_RollRate_t *rollRate
     * }
     */
    public static final AddressLayout rollRate$layout() {
        return rollRate$LAYOUT;
    }

    private static final long rollRate$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_RollRate_t *rollRate
     * }
     */
    public static final long rollRate$offset() {
        return rollRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_RollRate_t *rollRate
     * }
     */
    public static MemorySegment rollRate(MemorySegment struct) {
        return struct.get(rollRate$LAYOUT, rollRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CooperativeControlMessage_RollRate_t *rollRate
     * }
     */
    public static void rollRate(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rollRate$LAYOUT, rollRate$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

