// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct AxleWeightLimits {
 *     Int2Unsigned_t maxLadenweightOnAxle1;
 *     Int2Unsigned_t maxLadenweightOnAxle2;
 *     Int2Unsigned_t maxLadenweightOnAxle3;
 *     Int2Unsigned_t maxLadenweightOnAxle4;
 *     Int2Unsigned_t maxLadenweightOnAxle5;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class AxleWeightLimits {

    AxleWeightLimits() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("maxLadenweightOnAxle1"),
        MessageFrame_h.C_LONG.withName("maxLadenweightOnAxle2"),
        MessageFrame_h.C_LONG.withName("maxLadenweightOnAxle3"),
        MessageFrame_h.C_LONG.withName("maxLadenweightOnAxle4"),
        MessageFrame_h.C_LONG.withName("maxLadenweightOnAxle5"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("AxleWeightLimits");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong maxLadenweightOnAxle1$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenweightOnAxle1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle1
     * }
     */
    public static final OfLong maxLadenweightOnAxle1$layout() {
        return maxLadenweightOnAxle1$LAYOUT;
    }

    private static final long maxLadenweightOnAxle1$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle1
     * }
     */
    public static final long maxLadenweightOnAxle1$offset() {
        return maxLadenweightOnAxle1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle1
     * }
     */
    public static long maxLadenweightOnAxle1(MemorySegment struct) {
        return struct.get(maxLadenweightOnAxle1$LAYOUT, maxLadenweightOnAxle1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle1
     * }
     */
    public static void maxLadenweightOnAxle1(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenweightOnAxle1$LAYOUT, maxLadenweightOnAxle1$OFFSET, fieldValue);
    }

    private static final OfLong maxLadenweightOnAxle2$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenweightOnAxle2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle2
     * }
     */
    public static final OfLong maxLadenweightOnAxle2$layout() {
        return maxLadenweightOnAxle2$LAYOUT;
    }

    private static final long maxLadenweightOnAxle2$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle2
     * }
     */
    public static final long maxLadenweightOnAxle2$offset() {
        return maxLadenweightOnAxle2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle2
     * }
     */
    public static long maxLadenweightOnAxle2(MemorySegment struct) {
        return struct.get(maxLadenweightOnAxle2$LAYOUT, maxLadenweightOnAxle2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle2
     * }
     */
    public static void maxLadenweightOnAxle2(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenweightOnAxle2$LAYOUT, maxLadenweightOnAxle2$OFFSET, fieldValue);
    }

    private static final OfLong maxLadenweightOnAxle3$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenweightOnAxle3"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle3
     * }
     */
    public static final OfLong maxLadenweightOnAxle3$layout() {
        return maxLadenweightOnAxle3$LAYOUT;
    }

    private static final long maxLadenweightOnAxle3$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle3
     * }
     */
    public static final long maxLadenweightOnAxle3$offset() {
        return maxLadenweightOnAxle3$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle3
     * }
     */
    public static long maxLadenweightOnAxle3(MemorySegment struct) {
        return struct.get(maxLadenweightOnAxle3$LAYOUT, maxLadenweightOnAxle3$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle3
     * }
     */
    public static void maxLadenweightOnAxle3(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenweightOnAxle3$LAYOUT, maxLadenweightOnAxle3$OFFSET, fieldValue);
    }

    private static final OfLong maxLadenweightOnAxle4$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenweightOnAxle4"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle4
     * }
     */
    public static final OfLong maxLadenweightOnAxle4$layout() {
        return maxLadenweightOnAxle4$LAYOUT;
    }

    private static final long maxLadenweightOnAxle4$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle4
     * }
     */
    public static final long maxLadenweightOnAxle4$offset() {
        return maxLadenweightOnAxle4$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle4
     * }
     */
    public static long maxLadenweightOnAxle4(MemorySegment struct) {
        return struct.get(maxLadenweightOnAxle4$LAYOUT, maxLadenweightOnAxle4$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle4
     * }
     */
    public static void maxLadenweightOnAxle4(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenweightOnAxle4$LAYOUT, maxLadenweightOnAxle4$OFFSET, fieldValue);
    }

    private static final OfLong maxLadenweightOnAxle5$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenweightOnAxle5"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle5
     * }
     */
    public static final OfLong maxLadenweightOnAxle5$layout() {
        return maxLadenweightOnAxle5$LAYOUT;
    }

    private static final long maxLadenweightOnAxle5$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle5
     * }
     */
    public static final long maxLadenweightOnAxle5$offset() {
        return maxLadenweightOnAxle5$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle5
     * }
     */
    public static long maxLadenweightOnAxle5(MemorySegment struct) {
        return struct.get(maxLadenweightOnAxle5$LAYOUT, maxLadenweightOnAxle5$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t maxLadenweightOnAxle5
     * }
     */
    public static void maxLadenweightOnAxle5(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenweightOnAxle5$LAYOUT, maxLadenweightOnAxle5$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

