// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ChargesTable {
 *     ChargesTable_PR present;
 *     union ChargesTable_u {
 *         VehTypeChargesTable_t vehTypeBased;
 *         AxlesChargesTable_t numAxlesBased;
 *         WeightChargesTable_t weightBased;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class ChargesTable {

    ChargesTable() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        MemoryLayout.paddingLayout(4),
        ChargesTable_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("ChargesTable");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ChargesTable_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ChargesTable_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ChargesTable_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ChargesTable_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union ChargesTable_u {
     *     VehTypeChargesTable_t vehTypeBased;
     *     AxlesChargesTable_t numAxlesBased;
     *     WeightChargesTable_t weightBased;
     * }
     * }
     */
    public static class ChargesTable_u {

        ChargesTable_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            VehTypeChargesTable.layout().withName("vehTypeBased"),
            AxlesChargesTable.layout().withName("numAxlesBased"),
            WeightChargesTable.layout().withName("weightBased")
        ).withName("ChargesTable_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final GroupLayout vehTypeBased$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("vehTypeBased"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * VehTypeChargesTable_t vehTypeBased
         * }
         */
        public static final GroupLayout vehTypeBased$layout() {
            return vehTypeBased$LAYOUT;
        }

        private static final long vehTypeBased$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * VehTypeChargesTable_t vehTypeBased
         * }
         */
        public static final long vehTypeBased$offset() {
            return vehTypeBased$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * VehTypeChargesTable_t vehTypeBased
         * }
         */
        public static MemorySegment vehTypeBased(MemorySegment union) {
            return union.asSlice(vehTypeBased$OFFSET, vehTypeBased$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * VehTypeChargesTable_t vehTypeBased
         * }
         */
        public static void vehTypeBased(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, vehTypeBased$OFFSET, vehTypeBased$LAYOUT.byteSize());
        }

        private static final GroupLayout numAxlesBased$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("numAxlesBased"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * AxlesChargesTable_t numAxlesBased
         * }
         */
        public static final GroupLayout numAxlesBased$layout() {
            return numAxlesBased$LAYOUT;
        }

        private static final long numAxlesBased$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * AxlesChargesTable_t numAxlesBased
         * }
         */
        public static final long numAxlesBased$offset() {
            return numAxlesBased$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * AxlesChargesTable_t numAxlesBased
         * }
         */
        public static MemorySegment numAxlesBased(MemorySegment union) {
            return union.asSlice(numAxlesBased$OFFSET, numAxlesBased$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * AxlesChargesTable_t numAxlesBased
         * }
         */
        public static void numAxlesBased(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, numAxlesBased$OFFSET, numAxlesBased$LAYOUT.byteSize());
        }

        private static final GroupLayout weightBased$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("weightBased"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * WeightChargesTable_t weightBased
         * }
         */
        public static final GroupLayout weightBased$layout() {
            return weightBased$LAYOUT;
        }

        private static final long weightBased$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * WeightChargesTable_t weightBased
         * }
         */
        public static final long weightBased$offset() {
            return weightBased$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * WeightChargesTable_t weightBased
         * }
         */
        public static MemorySegment weightBased(MemorySegment union) {
            return union.asSlice(weightBased$OFFSET, weightBased$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * WeightChargesTable_t weightBased
         * }
         */
        public static void weightBased(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, weightBased$OFFSET, weightBased$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union ChargesTable_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union ChargesTable_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union ChargesTable_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union ChargesTable_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

