// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ChargerInfo {
 *     OBJECT_IDENTIFIER_t chargerID;
 *     DescriptiveName_t *descriptiveName;
 *     struct DDateTime *timeStamp;
 *     ChargingConfig_t chargingConfig;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class ChargerInfo {

    ChargerInfo() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ASN__PRIMITIVE_TYPE_s.layout().withName("chargerID"),
        MessageFrame_h.C_POINTER.withName("descriptiveName"),
        MessageFrame_h.C_POINTER.withName("timeStamp"),
        ChargingConfig.layout().withName("chargingConfig"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("ChargerInfo");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout chargerID$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("chargerID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * OBJECT_IDENTIFIER_t chargerID
     * }
     */
    public static final GroupLayout chargerID$layout() {
        return chargerID$LAYOUT;
    }

    private static final long chargerID$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * OBJECT_IDENTIFIER_t chargerID
     * }
     */
    public static final long chargerID$offset() {
        return chargerID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * OBJECT_IDENTIFIER_t chargerID
     * }
     */
    public static MemorySegment chargerID(MemorySegment struct) {
        return struct.asSlice(chargerID$OFFSET, chargerID$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * OBJECT_IDENTIFIER_t chargerID
     * }
     */
    public static void chargerID(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, chargerID$OFFSET, chargerID$LAYOUT.byteSize());
    }

    private static final AddressLayout descriptiveName$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("descriptiveName"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DescriptiveName_t *descriptiveName
     * }
     */
    public static final AddressLayout descriptiveName$layout() {
        return descriptiveName$LAYOUT;
    }

    private static final long descriptiveName$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DescriptiveName_t *descriptiveName
     * }
     */
    public static final long descriptiveName$offset() {
        return descriptiveName$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DescriptiveName_t *descriptiveName
     * }
     */
    public static MemorySegment descriptiveName(MemorySegment struct) {
        return struct.get(descriptiveName$LAYOUT, descriptiveName$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DescriptiveName_t *descriptiveName
     * }
     */
    public static void descriptiveName(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(descriptiveName$LAYOUT, descriptiveName$OFFSET, fieldValue);
    }

    private static final AddressLayout timeStamp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("timeStamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct DDateTime *timeStamp
     * }
     */
    public static final AddressLayout timeStamp$layout() {
        return timeStamp$LAYOUT;
    }

    private static final long timeStamp$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct DDateTime *timeStamp
     * }
     */
    public static final long timeStamp$offset() {
        return timeStamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct DDateTime *timeStamp
     * }
     */
    public static MemorySegment timeStamp(MemorySegment struct) {
        return struct.get(timeStamp$LAYOUT, timeStamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct DDateTime *timeStamp
     * }
     */
    public static void timeStamp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(timeStamp$LAYOUT, timeStamp$OFFSET, fieldValue);
    }

    private static final GroupLayout chargingConfig$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("chargingConfig"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ChargingConfig_t chargingConfig
     * }
     */
    public static final GroupLayout chargingConfig$layout() {
        return chargingConfig$LAYOUT;
    }

    private static final long chargingConfig$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ChargingConfig_t chargingConfig
     * }
     */
    public static final long chargingConfig$offset() {
        return chargingConfig$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ChargingConfig_t chargingConfig
     * }
     */
    public static MemorySegment chargingConfig(MemorySegment struct) {
        return struct.asSlice(chargingConfig$OFFSET, chargingConfig$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ChargingConfig_t chargingConfig
     * }
     */
    public static void chargingConfig(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, chargingConfig$OFFSET, chargingConfig$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 464;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

