// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ConfigDescriptor {
 *     ConfigId_t identifier;
 *     struct CfgVehicleClass *vehClass;
 *     struct RoadAuthorityID *roadAuthorityID;
 *     long *percentOfResp;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class ConfigDescriptor {

    ConfigDescriptor() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("identifier"),
        MessageFrame_h.C_POINTER.withName("vehClass"),
        MessageFrame_h.C_POINTER.withName("roadAuthorityID"),
        MessageFrame_h.C_POINTER.withName("percentOfResp"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("ConfigDescriptor");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong identifier$LAYOUT = (OfLong)$LAYOUT.select(groupElement("identifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ConfigId_t identifier
     * }
     */
    public static final OfLong identifier$layout() {
        return identifier$LAYOUT;
    }

    private static final long identifier$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ConfigId_t identifier
     * }
     */
    public static final long identifier$offset() {
        return identifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ConfigId_t identifier
     * }
     */
    public static long identifier(MemorySegment struct) {
        return struct.get(identifier$LAYOUT, identifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ConfigId_t identifier
     * }
     */
    public static void identifier(MemorySegment struct, long fieldValue) {
        struct.set(identifier$LAYOUT, identifier$OFFSET, fieldValue);
    }

    private static final AddressLayout vehClass$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("vehClass"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct CfgVehicleClass *vehClass
     * }
     */
    public static final AddressLayout vehClass$layout() {
        return vehClass$LAYOUT;
    }

    private static final long vehClass$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct CfgVehicleClass *vehClass
     * }
     */
    public static final long vehClass$offset() {
        return vehClass$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct CfgVehicleClass *vehClass
     * }
     */
    public static MemorySegment vehClass(MemorySegment struct) {
        return struct.get(vehClass$LAYOUT, vehClass$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct CfgVehicleClass *vehClass
     * }
     */
    public static void vehClass(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(vehClass$LAYOUT, vehClass$OFFSET, fieldValue);
    }

    private static final AddressLayout roadAuthorityID$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("roadAuthorityID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static final AddressLayout roadAuthorityID$layout() {
        return roadAuthorityID$LAYOUT;
    }

    private static final long roadAuthorityID$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static final long roadAuthorityID$offset() {
        return roadAuthorityID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static MemorySegment roadAuthorityID(MemorySegment struct) {
        return struct.get(roadAuthorityID$LAYOUT, roadAuthorityID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static void roadAuthorityID(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(roadAuthorityID$LAYOUT, roadAuthorityID$OFFSET, fieldValue);
    }

    private static final AddressLayout percentOfResp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("percentOfResp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long *percentOfResp
     * }
     */
    public static final AddressLayout percentOfResp$layout() {
        return percentOfResp$LAYOUT;
    }

    private static final long percentOfResp$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long *percentOfResp
     * }
     */
    public static final long percentOfResp$offset() {
        return percentOfResp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long *percentOfResp
     * }
     */
    public static MemorySegment percentOfResp(MemorySegment struct) {
        return struct.get(percentOfResp$LAYOUT, percentOfResp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long *percentOfResp
     * }
     */
    public static void percentOfResp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(percentOfResp$LAYOUT, percentOfResp$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

