// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct DTime {
 *     DHour_t hour;
 *     DMinute_t minute;
 *     DSecond_t second;
 *     DOffset_t *offset;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class DTime {

    DTime() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("hour"),
        MessageFrame_h.C_LONG.withName("minute"),
        MessageFrame_h.C_LONG.withName("second"),
        MessageFrame_h.C_POINTER.withName("offset"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("DTime");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong hour$LAYOUT = (OfLong)$LAYOUT.select(groupElement("hour"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DHour_t hour
     * }
     */
    public static final OfLong hour$layout() {
        return hour$LAYOUT;
    }

    private static final long hour$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DHour_t hour
     * }
     */
    public static final long hour$offset() {
        return hour$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DHour_t hour
     * }
     */
    public static long hour(MemorySegment struct) {
        return struct.get(hour$LAYOUT, hour$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DHour_t hour
     * }
     */
    public static void hour(MemorySegment struct, long fieldValue) {
        struct.set(hour$LAYOUT, hour$OFFSET, fieldValue);
    }

    private static final OfLong minute$LAYOUT = (OfLong)$LAYOUT.select(groupElement("minute"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DMinute_t minute
     * }
     */
    public static final OfLong minute$layout() {
        return minute$LAYOUT;
    }

    private static final long minute$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DMinute_t minute
     * }
     */
    public static final long minute$offset() {
        return minute$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DMinute_t minute
     * }
     */
    public static long minute(MemorySegment struct) {
        return struct.get(minute$LAYOUT, minute$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DMinute_t minute
     * }
     */
    public static void minute(MemorySegment struct, long fieldValue) {
        struct.set(minute$LAYOUT, minute$OFFSET, fieldValue);
    }

    private static final OfLong second$LAYOUT = (OfLong)$LAYOUT.select(groupElement("second"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DSecond_t second
     * }
     */
    public static final OfLong second$layout() {
        return second$LAYOUT;
    }

    private static final long second$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DSecond_t second
     * }
     */
    public static final long second$offset() {
        return second$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DSecond_t second
     * }
     */
    public static long second(MemorySegment struct) {
        return struct.get(second$LAYOUT, second$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DSecond_t second
     * }
     */
    public static void second(MemorySegment struct, long fieldValue) {
        struct.set(second$LAYOUT, second$OFFSET, fieldValue);
    }

    private static final AddressLayout offset$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("offset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DOffset_t *offset
     * }
     */
    public static final AddressLayout offset$layout() {
        return offset$LAYOUT;
    }

    private static final long offset$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DOffset_t *offset
     * }
     */
    public static final long offset$offset() {
        return offset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DOffset_t *offset
     * }
     */
    public static MemorySegment offset(MemorySegment struct) {
        return struct.get(offset$LAYOUT, offset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DOffset_t *offset
     * }
     */
    public static void offset(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(offset$LAYOUT, offset$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

