// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct EmergencyVehicleAlert {
 *     MinuteOfTheYear_t *timeStamp;
 *     TemporaryID_t *id;
 *     RoadSideAlert_t rsaMsg;
 *     ResponseType_t *responseType;
 *     struct EmergencyDetails *details;
 *     VehicleMass_t *mass;
 *     VehicleType_t *basicType;
 *     ITIS_VehicleGroupAffected_t *vehicleType;
 *     ITIS_IncidentResponseEquipment_t *responseEquip;
 *     ITIS_ResponderGroupAffected_t *responderType;
 *     struct EmergencyVehicleAlert__regional {
 *         struct {
 *             struct Reg_EmergencyVehicleAlert **array;
 *             int count;
 *             int size;
 *             void (*free)(struct Reg_EmergencyVehicleAlert *);
 *         } list;
 *         asn_struct_ctx_t _asn_ctx;
 *     } *regional;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class EmergencyVehicleAlert {

    EmergencyVehicleAlert() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_POINTER.withName("timeStamp"),
        MessageFrame_h.C_POINTER.withName("id"),
        RoadSideAlert.layout().withName("rsaMsg"),
        MessageFrame_h.C_POINTER.withName("responseType"),
        MessageFrame_h.C_POINTER.withName("details"),
        MessageFrame_h.C_POINTER.withName("mass"),
        MessageFrame_h.C_POINTER.withName("basicType"),
        MessageFrame_h.C_POINTER.withName("vehicleType"),
        MessageFrame_h.C_POINTER.withName("responseEquip"),
        MessageFrame_h.C_POINTER.withName("responderType"),
        MessageFrame_h.C_POINTER.withName("regional"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("EmergencyVehicleAlert");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout timeStamp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("timeStamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static final AddressLayout timeStamp$layout() {
        return timeStamp$LAYOUT;
    }

    private static final long timeStamp$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static final long timeStamp$offset() {
        return timeStamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static MemorySegment timeStamp(MemorySegment struct) {
        return struct.get(timeStamp$LAYOUT, timeStamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static void timeStamp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(timeStamp$LAYOUT, timeStamp$OFFSET, fieldValue);
    }

    private static final AddressLayout id$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TemporaryID_t *id
     * }
     */
    public static final AddressLayout id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TemporaryID_t *id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TemporaryID_t *id
     * }
     */
    public static MemorySegment id(MemorySegment struct) {
        return struct.get(id$LAYOUT, id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TemporaryID_t *id
     * }
     */
    public static void id(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(id$LAYOUT, id$OFFSET, fieldValue);
    }

    private static final GroupLayout rsaMsg$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("rsaMsg"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RoadSideAlert_t rsaMsg
     * }
     */
    public static final GroupLayout rsaMsg$layout() {
        return rsaMsg$LAYOUT;
    }

    private static final long rsaMsg$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RoadSideAlert_t rsaMsg
     * }
     */
    public static final long rsaMsg$offset() {
        return rsaMsg$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RoadSideAlert_t rsaMsg
     * }
     */
    public static MemorySegment rsaMsg(MemorySegment struct) {
        return struct.asSlice(rsaMsg$OFFSET, rsaMsg$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RoadSideAlert_t rsaMsg
     * }
     */
    public static void rsaMsg(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, rsaMsg$OFFSET, rsaMsg$LAYOUT.byteSize());
    }

    private static final AddressLayout responseType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("responseType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ResponseType_t *responseType
     * }
     */
    public static final AddressLayout responseType$layout() {
        return responseType$LAYOUT;
    }

    private static final long responseType$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ResponseType_t *responseType
     * }
     */
    public static final long responseType$offset() {
        return responseType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ResponseType_t *responseType
     * }
     */
    public static MemorySegment responseType(MemorySegment struct) {
        return struct.get(responseType$LAYOUT, responseType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ResponseType_t *responseType
     * }
     */
    public static void responseType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(responseType$LAYOUT, responseType$OFFSET, fieldValue);
    }

    private static final AddressLayout details$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("details"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct EmergencyDetails *details
     * }
     */
    public static final AddressLayout details$layout() {
        return details$LAYOUT;
    }

    private static final long details$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct EmergencyDetails *details
     * }
     */
    public static final long details$offset() {
        return details$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct EmergencyDetails *details
     * }
     */
    public static MemorySegment details(MemorySegment struct) {
        return struct.get(details$LAYOUT, details$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct EmergencyDetails *details
     * }
     */
    public static void details(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(details$LAYOUT, details$OFFSET, fieldValue);
    }

    private static final AddressLayout mass$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("mass"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VehicleMass_t *mass
     * }
     */
    public static final AddressLayout mass$layout() {
        return mass$LAYOUT;
    }

    private static final long mass$OFFSET = 136;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VehicleMass_t *mass
     * }
     */
    public static final long mass$offset() {
        return mass$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VehicleMass_t *mass
     * }
     */
    public static MemorySegment mass(MemorySegment struct) {
        return struct.get(mass$LAYOUT, mass$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VehicleMass_t *mass
     * }
     */
    public static void mass(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(mass$LAYOUT, mass$OFFSET, fieldValue);
    }

    private static final AddressLayout basicType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("basicType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VehicleType_t *basicType
     * }
     */
    public static final AddressLayout basicType$layout() {
        return basicType$LAYOUT;
    }

    private static final long basicType$OFFSET = 144;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VehicleType_t *basicType
     * }
     */
    public static final long basicType$offset() {
        return basicType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VehicleType_t *basicType
     * }
     */
    public static MemorySegment basicType(MemorySegment struct) {
        return struct.get(basicType$LAYOUT, basicType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VehicleType_t *basicType
     * }
     */
    public static void basicType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(basicType$LAYOUT, basicType$OFFSET, fieldValue);
    }

    private static final AddressLayout vehicleType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("vehicleType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static final AddressLayout vehicleType$layout() {
        return vehicleType$LAYOUT;
    }

    private static final long vehicleType$OFFSET = 152;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static final long vehicleType$offset() {
        return vehicleType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static MemorySegment vehicleType(MemorySegment struct) {
        return struct.get(vehicleType$LAYOUT, vehicleType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static void vehicleType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(vehicleType$LAYOUT, vehicleType$OFFSET, fieldValue);
    }

    private static final AddressLayout responseEquip$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("responseEquip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static final AddressLayout responseEquip$layout() {
        return responseEquip$LAYOUT;
    }

    private static final long responseEquip$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static final long responseEquip$offset() {
        return responseEquip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static MemorySegment responseEquip(MemorySegment struct) {
        return struct.get(responseEquip$LAYOUT, responseEquip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static void responseEquip(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(responseEquip$LAYOUT, responseEquip$OFFSET, fieldValue);
    }

    private static final AddressLayout responderType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("responderType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static final AddressLayout responderType$layout() {
        return responderType$LAYOUT;
    }

    private static final long responderType$OFFSET = 168;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static final long responderType$offset() {
        return responderType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static MemorySegment responderType(MemorySegment struct) {
        return struct.get(responderType$LAYOUT, responderType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static void responderType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(responderType$LAYOUT, responderType$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct EmergencyVehicleAlert__regional {
     *     struct {
     *         struct Reg_EmergencyVehicleAlert **array;
     *         int count;
     *         int size;
     *         void (*free)(struct Reg_EmergencyVehicleAlert *);
     *     } list;
     *     asn_struct_ctx_t _asn_ctx;
     * }
     * }
     */
    public static class EmergencyVehicleAlert__regional {

        EmergencyVehicleAlert__regional() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            list.layout().withName("list"),
            asn_struct_ctx_s.layout().withName("_asn_ctx")
        ).withName("EmergencyVehicleAlert__regional");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     struct Reg_EmergencyVehicleAlert **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_EmergencyVehicleAlert *);
         * }
         * }
         */
        public static class list {

            list() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                MessageFrame_h.C_POINTER.withName("array"),
                MessageFrame_h.C_INT.withName("count"),
                MessageFrame_h.C_INT.withName("size"),
                MessageFrame_h.C_POINTER.withName("free")
            ).withName("$anon$49:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final AddressLayout array$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("array"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct Reg_EmergencyVehicleAlert **array
             * }
             */
            public static final AddressLayout array$layout() {
                return array$LAYOUT;
            }

            private static final long array$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct Reg_EmergencyVehicleAlert **array
             * }
             */
            public static final long array$offset() {
                return array$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct Reg_EmergencyVehicleAlert **array
             * }
             */
            public static MemorySegment array(MemorySegment struct) {
                return struct.get(array$LAYOUT, array$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct Reg_EmergencyVehicleAlert **array
             * }
             */
            public static void array(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(array$LAYOUT, array$OFFSET, fieldValue);
            }

            private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final OfInt count$layout() {
                return count$LAYOUT;
            }

            private static final long count$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final long count$offset() {
                return count$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static int count(MemorySegment struct) {
                return struct.get(count$LAYOUT, count$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static void count(MemorySegment struct, int fieldValue) {
                struct.set(count$LAYOUT, count$OFFSET, fieldValue);
            }

            private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final OfInt size$layout() {
                return size$LAYOUT;
            }

            private static final long size$OFFSET = 12;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final long size$offset() {
                return size$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static int size(MemorySegment struct) {
                return struct.get(size$LAYOUT, size$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static void size(MemorySegment struct, int fieldValue) {
                struct.set(size$LAYOUT, size$OFFSET, fieldValue);
            }

            /**
             * {@snippet lang=c :
             * void (*free)(struct Reg_EmergencyVehicleAlert *)
             * }
             */
            public static class free {

                free() {
                    // Should not be called directly
                }

                /**
                 * The function pointer signature, expressed as a functional interface
                 */
                public interface Function {
                    void apply(MemorySegment _x0);
                }

                private static final FunctionDescriptor $DESC = FunctionDescriptor.ofVoid(
                    MessageFrame_h.C_POINTER
                );

                /**
                 * The descriptor of this function pointer
                 */
                public static FunctionDescriptor descriptor() {
                    return $DESC;
                }

                private static final MethodHandle UP$MH = MessageFrame_h.upcallHandle(Function.class, "apply", $DESC);

                /**
                 * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
                 * The lifetime of the returned segment is managed by {@code arena}
                 */
                public static MemorySegment allocate(Function fi, Arena arena) {
                    return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
                }

                private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

                /**
                 * Invoke the upcall stub {@code funcPtr}, with given parameters
                 */
                public static void invoke(MemorySegment funcPtr,MemorySegment _x0) {
                    try {
                         DOWN$MH.invokeExact(funcPtr, _x0);
                    } catch (Throwable ex$) {
                        throw new AssertionError("should not reach here", ex$);
                    }
                }
            }

            private static final AddressLayout free$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("free"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_EmergencyVehicleAlert *)
             * }
             */
            public static final AddressLayout free$layout() {
                return free$LAYOUT;
            }

            private static final long free$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_EmergencyVehicleAlert *)
             * }
             */
            public static final long free$offset() {
                return free$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_EmergencyVehicleAlert *)
             * }
             */
            public static MemorySegment free(MemorySegment struct) {
                return struct.get(free$LAYOUT, free$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_EmergencyVehicleAlert *)
             * }
             */
            public static void free(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(free$LAYOUT, free$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout list$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("list"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_EmergencyVehicleAlert **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_EmergencyVehicleAlert *);
         * } list
         * }
         */
        public static final GroupLayout list$layout() {
            return list$LAYOUT;
        }

        private static final long list$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_EmergencyVehicleAlert **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_EmergencyVehicleAlert *);
         * } list
         * }
         */
        public static final long list$offset() {
            return list$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_EmergencyVehicleAlert **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_EmergencyVehicleAlert *);
         * } list
         * }
         */
        public static MemorySegment list(MemorySegment struct) {
            return struct.asSlice(list$OFFSET, list$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_EmergencyVehicleAlert **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_EmergencyVehicleAlert *);
         * } list
         * }
         */
        public static void list(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, list$OFFSET, list$LAYOUT.byteSize());
        }

        private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final GroupLayout _asn_ctx$layout() {
            return _asn_ctx$LAYOUT;
        }

        private static final long _asn_ctx$OFFSET = 24;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final long _asn_ctx$offset() {
            return _asn_ctx$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static MemorySegment _asn_ctx(MemorySegment struct) {
            return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final AddressLayout regional$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("regional"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct EmergencyVehicleAlert__regional *regional
     * }
     */
    public static final AddressLayout regional$layout() {
        return regional$LAYOUT;
    }

    private static final long regional$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct EmergencyVehicleAlert__regional *regional
     * }
     */
    public static final long regional$offset() {
        return regional$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct EmergencyVehicleAlert__regional *regional
     * }
     */
    public static MemorySegment regional(MemorySegment struct) {
        return struct.get(regional$LAYOUT, regional$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct EmergencyVehicleAlert__regional *regional
     * }
     */
    public static void regional(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(regional$LAYOUT, regional$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
