// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ExhaustEmissionValues {
 *     EmissionUnit_t unitType;
 *     long emissionCo;
 *     Int2Unsigned_t emissionHc;
 *     Int2Unsigned_t emissionNox;
 *     Int2Unsigned_t emissionHcNox;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class ExhaustEmissionValues {

    ExhaustEmissionValues() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("unitType"),
        MessageFrame_h.C_LONG.withName("emissionCo"),
        MessageFrame_h.C_LONG.withName("emissionHc"),
        MessageFrame_h.C_LONG.withName("emissionNox"),
        MessageFrame_h.C_LONG.withName("emissionHcNox"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("ExhaustEmissionValues");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong unitType$LAYOUT = (OfLong)$LAYOUT.select(groupElement("unitType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EmissionUnit_t unitType
     * }
     */
    public static final OfLong unitType$layout() {
        return unitType$LAYOUT;
    }

    private static final long unitType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EmissionUnit_t unitType
     * }
     */
    public static final long unitType$offset() {
        return unitType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EmissionUnit_t unitType
     * }
     */
    public static long unitType(MemorySegment struct) {
        return struct.get(unitType$LAYOUT, unitType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EmissionUnit_t unitType
     * }
     */
    public static void unitType(MemorySegment struct, long fieldValue) {
        struct.set(unitType$LAYOUT, unitType$OFFSET, fieldValue);
    }

    private static final OfLong emissionCo$LAYOUT = (OfLong)$LAYOUT.select(groupElement("emissionCo"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long emissionCo
     * }
     */
    public static final OfLong emissionCo$layout() {
        return emissionCo$LAYOUT;
    }

    private static final long emissionCo$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long emissionCo
     * }
     */
    public static final long emissionCo$offset() {
        return emissionCo$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long emissionCo
     * }
     */
    public static long emissionCo(MemorySegment struct) {
        return struct.get(emissionCo$LAYOUT, emissionCo$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long emissionCo
     * }
     */
    public static void emissionCo(MemorySegment struct, long fieldValue) {
        struct.set(emissionCo$LAYOUT, emissionCo$OFFSET, fieldValue);
    }

    private static final OfLong emissionHc$LAYOUT = (OfLong)$LAYOUT.select(groupElement("emissionHc"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHc
     * }
     */
    public static final OfLong emissionHc$layout() {
        return emissionHc$LAYOUT;
    }

    private static final long emissionHc$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHc
     * }
     */
    public static final long emissionHc$offset() {
        return emissionHc$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHc
     * }
     */
    public static long emissionHc(MemorySegment struct) {
        return struct.get(emissionHc$LAYOUT, emissionHc$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHc
     * }
     */
    public static void emissionHc(MemorySegment struct, long fieldValue) {
        struct.set(emissionHc$LAYOUT, emissionHc$OFFSET, fieldValue);
    }

    private static final OfLong emissionNox$LAYOUT = (OfLong)$LAYOUT.select(groupElement("emissionNox"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionNox
     * }
     */
    public static final OfLong emissionNox$layout() {
        return emissionNox$LAYOUT;
    }

    private static final long emissionNox$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionNox
     * }
     */
    public static final long emissionNox$offset() {
        return emissionNox$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionNox
     * }
     */
    public static long emissionNox(MemorySegment struct) {
        return struct.get(emissionNox$LAYOUT, emissionNox$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionNox
     * }
     */
    public static void emissionNox(MemorySegment struct, long fieldValue) {
        struct.set(emissionNox$LAYOUT, emissionNox$OFFSET, fieldValue);
    }

    private static final OfLong emissionHcNox$LAYOUT = (OfLong)$LAYOUT.select(groupElement("emissionHcNox"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHcNox
     * }
     */
    public static final OfLong emissionHcNox$layout() {
        return emissionHcNox$LAYOUT;
    }

    private static final long emissionHcNox$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHcNox
     * }
     */
    public static final long emissionHcNox$offset() {
        return emissionHcNox$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHcNox
     * }
     */
    public static long emissionHcNox(MemorySegment struct) {
        return struct.get(emissionHcNox$LAYOUT, emissionHcNox$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Int2Unsigned_t emissionHcNox
     * }
     */
    public static void emissionHcNox(MemorySegment struct, long fieldValue) {
        struct.set(emissionHcNox$LAYOUT, emissionHcNox$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

