// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct IntersectionCollision {
 *     Common_MsgCount_t msgCnt;
 *     TemporaryID_t id;
 *     MinuteOfTheYear_t *timeStamp;
 *     struct BSMcoreData *partOne;
 *     struct PathHistory *path;
 *     struct PathPrediction *pathPrediction;
 *     IntersectionReferenceID_t intersectionID;
 *     ApproachOrLane_t laneNumber;
 *     VehicleEventFlags_t eventFlag;
 *     struct IntersectionCollision__regional {
 *         struct {
 *             struct Reg_IntersectionCollision **array;
 *             int count;
 *             int size;
 *             void (*free)(struct Reg_IntersectionCollision *);
 *         } list;
 *         asn_struct_ctx_t _asn_ctx;
 *     } *regional;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class IntersectionCollision {

    IntersectionCollision() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("msgCnt"),
        OCTET_STRING.layout().withName("id"),
        MessageFrame_h.C_POINTER.withName("timeStamp"),
        MessageFrame_h.C_POINTER.withName("partOne"),
        MessageFrame_h.C_POINTER.withName("path"),
        MessageFrame_h.C_POINTER.withName("pathPrediction"),
        IntersectionReferenceID.layout().withName("intersectionID"),
        ApproachOrLane.layout().withName("laneNumber"),
        BIT_STRING_s.layout().withName("eventFlag"),
        MessageFrame_h.C_POINTER.withName("regional"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("IntersectionCollision");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong msgCnt$LAYOUT = (OfLong)$LAYOUT.select(groupElement("msgCnt"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Common_MsgCount_t msgCnt
     * }
     */
    public static final OfLong msgCnt$layout() {
        return msgCnt$LAYOUT;
    }

    private static final long msgCnt$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Common_MsgCount_t msgCnt
     * }
     */
    public static final long msgCnt$offset() {
        return msgCnt$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Common_MsgCount_t msgCnt
     * }
     */
    public static long msgCnt(MemorySegment struct) {
        return struct.get(msgCnt$LAYOUT, msgCnt$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Common_MsgCount_t msgCnt
     * }
     */
    public static void msgCnt(MemorySegment struct, long fieldValue) {
        struct.set(msgCnt$LAYOUT, msgCnt$OFFSET, fieldValue);
    }

    private static final GroupLayout id$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * TemporaryID_t id
     * }
     */
    public static final GroupLayout id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * TemporaryID_t id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * TemporaryID_t id
     * }
     */
    public static MemorySegment id(MemorySegment struct) {
        return struct.asSlice(id$OFFSET, id$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * TemporaryID_t id
     * }
     */
    public static void id(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, id$OFFSET, id$LAYOUT.byteSize());
    }

    private static final AddressLayout timeStamp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("timeStamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static final AddressLayout timeStamp$layout() {
        return timeStamp$LAYOUT;
    }

    private static final long timeStamp$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static final long timeStamp$offset() {
        return timeStamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static MemorySegment timeStamp(MemorySegment struct) {
        return struct.get(timeStamp$LAYOUT, timeStamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *timeStamp
     * }
     */
    public static void timeStamp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(timeStamp$LAYOUT, timeStamp$OFFSET, fieldValue);
    }

    private static final AddressLayout partOne$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("partOne"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct BSMcoreData *partOne
     * }
     */
    public static final AddressLayout partOne$layout() {
        return partOne$LAYOUT;
    }

    private static final long partOne$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct BSMcoreData *partOne
     * }
     */
    public static final long partOne$offset() {
        return partOne$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct BSMcoreData *partOne
     * }
     */
    public static MemorySegment partOne(MemorySegment struct) {
        return struct.get(partOne$LAYOUT, partOne$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct BSMcoreData *partOne
     * }
     */
    public static void partOne(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(partOne$LAYOUT, partOne$OFFSET, fieldValue);
    }

    private static final AddressLayout path$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("path"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct PathHistory *path
     * }
     */
    public static final AddressLayout path$layout() {
        return path$LAYOUT;
    }

    private static final long path$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct PathHistory *path
     * }
     */
    public static final long path$offset() {
        return path$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct PathHistory *path
     * }
     */
    public static MemorySegment path(MemorySegment struct) {
        return struct.get(path$LAYOUT, path$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct PathHistory *path
     * }
     */
    public static void path(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(path$LAYOUT, path$OFFSET, fieldValue);
    }

    private static final AddressLayout pathPrediction$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("pathPrediction"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct PathPrediction *pathPrediction
     * }
     */
    public static final AddressLayout pathPrediction$layout() {
        return pathPrediction$LAYOUT;
    }

    private static final long pathPrediction$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct PathPrediction *pathPrediction
     * }
     */
    public static final long pathPrediction$offset() {
        return pathPrediction$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct PathPrediction *pathPrediction
     * }
     */
    public static MemorySegment pathPrediction(MemorySegment struct) {
        return struct.get(pathPrediction$LAYOUT, pathPrediction$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct PathPrediction *pathPrediction
     * }
     */
    public static void pathPrediction(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(pathPrediction$LAYOUT, pathPrediction$OFFSET, fieldValue);
    }

    private static final GroupLayout intersectionID$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("intersectionID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t intersectionID
     * }
     */
    public static final GroupLayout intersectionID$layout() {
        return intersectionID$LAYOUT;
    }

    private static final long intersectionID$OFFSET = 80;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t intersectionID
     * }
     */
    public static final long intersectionID$offset() {
        return intersectionID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t intersectionID
     * }
     */
    public static MemorySegment intersectionID(MemorySegment struct) {
        return struct.asSlice(intersectionID$OFFSET, intersectionID$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t intersectionID
     * }
     */
    public static void intersectionID(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, intersectionID$OFFSET, intersectionID$LAYOUT.byteSize());
    }

    private static final GroupLayout laneNumber$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("laneNumber"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ApproachOrLane_t laneNumber
     * }
     */
    public static final GroupLayout laneNumber$layout() {
        return laneNumber$LAYOUT;
    }

    private static final long laneNumber$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ApproachOrLane_t laneNumber
     * }
     */
    public static final long laneNumber$offset() {
        return laneNumber$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ApproachOrLane_t laneNumber
     * }
     */
    public static MemorySegment laneNumber(MemorySegment struct) {
        return struct.asSlice(laneNumber$OFFSET, laneNumber$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ApproachOrLane_t laneNumber
     * }
     */
    public static void laneNumber(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, laneNumber$OFFSET, laneNumber$LAYOUT.byteSize());
    }

    private static final GroupLayout eventFlag$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("eventFlag"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VehicleEventFlags_t eventFlag
     * }
     */
    public static final GroupLayout eventFlag$layout() {
        return eventFlag$LAYOUT;
    }

    private static final long eventFlag$OFFSET = 160;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VehicleEventFlags_t eventFlag
     * }
     */
    public static final long eventFlag$offset() {
        return eventFlag$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VehicleEventFlags_t eventFlag
     * }
     */
    public static MemorySegment eventFlag(MemorySegment struct) {
        return struct.asSlice(eventFlag$OFFSET, eventFlag$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VehicleEventFlags_t eventFlag
     * }
     */
    public static void eventFlag(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, eventFlag$OFFSET, eventFlag$LAYOUT.byteSize());
    }

    /**
     * {@snippet lang=c :
     * struct IntersectionCollision__regional {
     *     struct {
     *         struct Reg_IntersectionCollision **array;
     *         int count;
     *         int size;
     *         void (*free)(struct Reg_IntersectionCollision *);
     *     } list;
     *     asn_struct_ctx_t _asn_ctx;
     * }
     * }
     */
    public static class IntersectionCollision__regional {

        IntersectionCollision__regional() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            list.layout().withName("list"),
            asn_struct_ctx_s.layout().withName("_asn_ctx")
        ).withName("IntersectionCollision__regional");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionCollision **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionCollision *);
         * }
         * }
         */
        public static class list {

            list() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                MessageFrame_h.C_POINTER.withName("array"),
                MessageFrame_h.C_INT.withName("count"),
                MessageFrame_h.C_INT.withName("size"),
                MessageFrame_h.C_POINTER.withName("free")
            ).withName("$anon$47:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final AddressLayout array$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("array"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionCollision **array
             * }
             */
            public static final AddressLayout array$layout() {
                return array$LAYOUT;
            }

            private static final long array$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionCollision **array
             * }
             */
            public static final long array$offset() {
                return array$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionCollision **array
             * }
             */
            public static MemorySegment array(MemorySegment struct) {
                return struct.get(array$LAYOUT, array$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionCollision **array
             * }
             */
            public static void array(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(array$LAYOUT, array$OFFSET, fieldValue);
            }

            private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final OfInt count$layout() {
                return count$LAYOUT;
            }

            private static final long count$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final long count$offset() {
                return count$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static int count(MemorySegment struct) {
                return struct.get(count$LAYOUT, count$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static void count(MemorySegment struct, int fieldValue) {
                struct.set(count$LAYOUT, count$OFFSET, fieldValue);
            }

            private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final OfInt size$layout() {
                return size$LAYOUT;
            }

            private static final long size$OFFSET = 12;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final long size$offset() {
                return size$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static int size(MemorySegment struct) {
                return struct.get(size$LAYOUT, size$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static void size(MemorySegment struct, int fieldValue) {
                struct.set(size$LAYOUT, size$OFFSET, fieldValue);
            }

            /**
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionCollision *)
             * }
             */
            public static class free {

                free() {
                    // Should not be called directly
                }

                /**
                 * The function pointer signature, expressed as a functional interface
                 */
                public interface Function {
                    void apply(MemorySegment _x0);
                }

                private static final FunctionDescriptor $DESC = FunctionDescriptor.ofVoid(
                    MessageFrame_h.C_POINTER
                );

                /**
                 * The descriptor of this function pointer
                 */
                public static FunctionDescriptor descriptor() {
                    return $DESC;
                }

                private static final MethodHandle UP$MH = MessageFrame_h.upcallHandle(Function.class, "apply", $DESC);

                /**
                 * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
                 * The lifetime of the returned segment is managed by {@code arena}
                 */
                public static MemorySegment allocate(Function fi, Arena arena) {
                    return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
                }

                private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

                /**
                 * Invoke the upcall stub {@code funcPtr}, with given parameters
                 */
                public static void invoke(MemorySegment funcPtr,MemorySegment _x0) {
                    try {
                         DOWN$MH.invokeExact(funcPtr, _x0);
                    } catch (Throwable ex$) {
                        throw new AssertionError("should not reach here", ex$);
                    }
                }
            }

            private static final AddressLayout free$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("free"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionCollision *)
             * }
             */
            public static final AddressLayout free$layout() {
                return free$LAYOUT;
            }

            private static final long free$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionCollision *)
             * }
             */
            public static final long free$offset() {
                return free$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionCollision *)
             * }
             */
            public static MemorySegment free(MemorySegment struct) {
                return struct.get(free$LAYOUT, free$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionCollision *)
             * }
             */
            public static void free(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(free$LAYOUT, free$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout list$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("list"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionCollision **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionCollision *);
         * } list
         * }
         */
        public static final GroupLayout list$layout() {
            return list$LAYOUT;
        }

        private static final long list$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionCollision **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionCollision *);
         * } list
         * }
         */
        public static final long list$offset() {
            return list$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionCollision **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionCollision *);
         * } list
         * }
         */
        public static MemorySegment list(MemorySegment struct) {
            return struct.asSlice(list$OFFSET, list$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionCollision **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionCollision *);
         * } list
         * }
         */
        public static void list(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, list$OFFSET, list$LAYOUT.byteSize());
        }

        private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final GroupLayout _asn_ctx$layout() {
            return _asn_ctx$LAYOUT;
        }

        private static final long _asn_ctx$OFFSET = 24;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final long _asn_ctx$offset() {
            return _asn_ctx$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static MemorySegment _asn_ctx(MemorySegment struct) {
            return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final AddressLayout regional$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("regional"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IntersectionCollision__regional *regional
     * }
     */
    public static final AddressLayout regional$layout() {
        return regional$LAYOUT;
    }

    private static final long regional$OFFSET = 208;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IntersectionCollision__regional *regional
     * }
     */
    public static final long regional$offset() {
        return regional$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IntersectionCollision__regional *regional
     * }
     */
    public static MemorySegment regional(MemorySegment struct) {
        return struct.get(regional$LAYOUT, regional$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IntersectionCollision__regional *regional
     * }
     */
    public static void regional(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(regional$LAYOUT, regional$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 216;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
