// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct IntersectionState {
 *     DescriptiveName_t *name;
 *     IntersectionReferenceID_t id;
 *     Common_MsgCount_t revision;
 *     IntersectionStatusObject_t status;
 *     MinuteOfTheYear_t *moy;
 *     DSecond_t *timeStamp;
 *     struct EnabledLaneList *enabledLanes;
 *     MovementList_t states;
 *     struct ManeuverAssistList *maneuverAssistList;
 *     struct IntersectionState__regional {
 *         struct {
 *             struct Reg_IntersectionState **array;
 *             int count;
 *             int size;
 *             void (*free)(struct Reg_IntersectionState *);
 *         } list;
 *         asn_struct_ctx_t _asn_ctx;
 *     } *regional;
 *     struct RoadAuthorityID *roadAuthorityID;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class IntersectionState {

    IntersectionState() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_POINTER.withName("name"),
        IntersectionReferenceID.layout().withName("id"),
        MessageFrame_h.C_LONG.withName("revision"),
        BIT_STRING_s.layout().withName("status"),
        MessageFrame_h.C_POINTER.withName("moy"),
        MessageFrame_h.C_POINTER.withName("timeStamp"),
        MessageFrame_h.C_POINTER.withName("enabledLanes"),
        MovementList.layout().withName("states"),
        MessageFrame_h.C_POINTER.withName("maneuverAssistList"),
        MessageFrame_h.C_POINTER.withName("regional"),
        MessageFrame_h.C_POINTER.withName("roadAuthorityID"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("IntersectionState");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DescriptiveName_t *name
     * }
     */
    public static final AddressLayout name$layout() {
        return name$LAYOUT;
    }

    private static final long name$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DescriptiveName_t *name
     * }
     */
    public static final long name$offset() {
        return name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DescriptiveName_t *name
     * }
     */
    public static MemorySegment name(MemorySegment struct) {
        return struct.get(name$LAYOUT, name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DescriptiveName_t *name
     * }
     */
    public static void name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(name$LAYOUT, name$OFFSET, fieldValue);
    }

    private static final GroupLayout id$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t id
     * }
     */
    public static final GroupLayout id$layout() {
        return id$LAYOUT;
    }

    private static final long id$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t id
     * }
     */
    public static final long id$offset() {
        return id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t id
     * }
     */
    public static MemorySegment id(MemorySegment struct) {
        return struct.asSlice(id$OFFSET, id$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IntersectionReferenceID_t id
     * }
     */
    public static void id(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, id$OFFSET, id$LAYOUT.byteSize());
    }

    private static final OfLong revision$LAYOUT = (OfLong)$LAYOUT.select(groupElement("revision"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Common_MsgCount_t revision
     * }
     */
    public static final OfLong revision$layout() {
        return revision$LAYOUT;
    }

    private static final long revision$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Common_MsgCount_t revision
     * }
     */
    public static final long revision$offset() {
        return revision$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Common_MsgCount_t revision
     * }
     */
    public static long revision(MemorySegment struct) {
        return struct.get(revision$LAYOUT, revision$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Common_MsgCount_t revision
     * }
     */
    public static void revision(MemorySegment struct, long fieldValue) {
        struct.set(revision$LAYOUT, revision$OFFSET, fieldValue);
    }

    private static final GroupLayout status$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("status"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IntersectionStatusObject_t status
     * }
     */
    public static final GroupLayout status$layout() {
        return status$LAYOUT;
    }

    private static final long status$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IntersectionStatusObject_t status
     * }
     */
    public static final long status$offset() {
        return status$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IntersectionStatusObject_t status
     * }
     */
    public static MemorySegment status(MemorySegment struct) {
        return struct.asSlice(status$OFFSET, status$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IntersectionStatusObject_t status
     * }
     */
    public static void status(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, status$OFFSET, status$LAYOUT.byteSize());
    }

    private static final AddressLayout moy$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("moy"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *moy
     * }
     */
    public static final AddressLayout moy$layout() {
        return moy$LAYOUT;
    }

    private static final long moy$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *moy
     * }
     */
    public static final long moy$offset() {
        return moy$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *moy
     * }
     */
    public static MemorySegment moy(MemorySegment struct) {
        return struct.get(moy$LAYOUT, moy$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MinuteOfTheYear_t *moy
     * }
     */
    public static void moy(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(moy$LAYOUT, moy$OFFSET, fieldValue);
    }

    private static final AddressLayout timeStamp$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("timeStamp"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * DSecond_t *timeStamp
     * }
     */
    public static final AddressLayout timeStamp$layout() {
        return timeStamp$LAYOUT;
    }

    private static final long timeStamp$OFFSET = 112;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * DSecond_t *timeStamp
     * }
     */
    public static final long timeStamp$offset() {
        return timeStamp$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * DSecond_t *timeStamp
     * }
     */
    public static MemorySegment timeStamp(MemorySegment struct) {
        return struct.get(timeStamp$LAYOUT, timeStamp$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * DSecond_t *timeStamp
     * }
     */
    public static void timeStamp(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(timeStamp$LAYOUT, timeStamp$OFFSET, fieldValue);
    }

    private static final AddressLayout enabledLanes$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("enabledLanes"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct EnabledLaneList *enabledLanes
     * }
     */
    public static final AddressLayout enabledLanes$layout() {
        return enabledLanes$LAYOUT;
    }

    private static final long enabledLanes$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct EnabledLaneList *enabledLanes
     * }
     */
    public static final long enabledLanes$offset() {
        return enabledLanes$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct EnabledLaneList *enabledLanes
     * }
     */
    public static MemorySegment enabledLanes(MemorySegment struct) {
        return struct.get(enabledLanes$LAYOUT, enabledLanes$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct EnabledLaneList *enabledLanes
     * }
     */
    public static void enabledLanes(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(enabledLanes$LAYOUT, enabledLanes$OFFSET, fieldValue);
    }

    private static final GroupLayout states$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("states"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * MovementList_t states
     * }
     */
    public static final GroupLayout states$layout() {
        return states$LAYOUT;
    }

    private static final long states$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * MovementList_t states
     * }
     */
    public static final long states$offset() {
        return states$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * MovementList_t states
     * }
     */
    public static MemorySegment states(MemorySegment struct) {
        return struct.asSlice(states$OFFSET, states$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * MovementList_t states
     * }
     */
    public static void states(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, states$OFFSET, states$LAYOUT.byteSize());
    }

    private static final AddressLayout maneuverAssistList$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("maneuverAssistList"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ManeuverAssistList *maneuverAssistList
     * }
     */
    public static final AddressLayout maneuverAssistList$layout() {
        return maneuverAssistList$LAYOUT;
    }

    private static final long maneuverAssistList$OFFSET = 176;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ManeuverAssistList *maneuverAssistList
     * }
     */
    public static final long maneuverAssistList$offset() {
        return maneuverAssistList$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ManeuverAssistList *maneuverAssistList
     * }
     */
    public static MemorySegment maneuverAssistList(MemorySegment struct) {
        return struct.get(maneuverAssistList$LAYOUT, maneuverAssistList$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ManeuverAssistList *maneuverAssistList
     * }
     */
    public static void maneuverAssistList(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(maneuverAssistList$LAYOUT, maneuverAssistList$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct IntersectionState__regional {
     *     struct {
     *         struct Reg_IntersectionState **array;
     *         int count;
     *         int size;
     *         void (*free)(struct Reg_IntersectionState *);
     *     } list;
     *     asn_struct_ctx_t _asn_ctx;
     * }
     * }
     */
    public static class IntersectionState__regional {

        IntersectionState__regional() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            list.layout().withName("list"),
            asn_struct_ctx_s.layout().withName("_asn_ctx")
        ).withName("IntersectionState__regional");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionState **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionState *);
         * }
         * }
         */
        public static class list {

            list() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                MessageFrame_h.C_POINTER.withName("array"),
                MessageFrame_h.C_INT.withName("count"),
                MessageFrame_h.C_INT.withName("size"),
                MessageFrame_h.C_POINTER.withName("free")
            ).withName("$anon$48:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final AddressLayout array$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("array"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionState **array
             * }
             */
            public static final AddressLayout array$layout() {
                return array$LAYOUT;
            }

            private static final long array$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionState **array
             * }
             */
            public static final long array$offset() {
                return array$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionState **array
             * }
             */
            public static MemorySegment array(MemorySegment struct) {
                return struct.get(array$LAYOUT, array$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct Reg_IntersectionState **array
             * }
             */
            public static void array(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(array$LAYOUT, array$OFFSET, fieldValue);
            }

            private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final OfInt count$layout() {
                return count$LAYOUT;
            }

            private static final long count$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final long count$offset() {
                return count$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static int count(MemorySegment struct) {
                return struct.get(count$LAYOUT, count$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static void count(MemorySegment struct, int fieldValue) {
                struct.set(count$LAYOUT, count$OFFSET, fieldValue);
            }

            private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final OfInt size$layout() {
                return size$LAYOUT;
            }

            private static final long size$OFFSET = 12;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final long size$offset() {
                return size$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static int size(MemorySegment struct) {
                return struct.get(size$LAYOUT, size$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static void size(MemorySegment struct, int fieldValue) {
                struct.set(size$LAYOUT, size$OFFSET, fieldValue);
            }

            /**
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionState *)
             * }
             */
            public static class free {

                free() {
                    // Should not be called directly
                }

                /**
                 * The function pointer signature, expressed as a functional interface
                 */
                public interface Function {
                    void apply(MemorySegment _x0);
                }

                private static final FunctionDescriptor $DESC = FunctionDescriptor.ofVoid(
                    MessageFrame_h.C_POINTER
                );

                /**
                 * The descriptor of this function pointer
                 */
                public static FunctionDescriptor descriptor() {
                    return $DESC;
                }

                private static final MethodHandle UP$MH = MessageFrame_h.upcallHandle(Function.class, "apply", $DESC);

                /**
                 * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
                 * The lifetime of the returned segment is managed by {@code arena}
                 */
                public static MemorySegment allocate(Function fi, Arena arena) {
                    return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
                }

                private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

                /**
                 * Invoke the upcall stub {@code funcPtr}, with given parameters
                 */
                public static void invoke(MemorySegment funcPtr,MemorySegment _x0) {
                    try {
                         DOWN$MH.invokeExact(funcPtr, _x0);
                    } catch (Throwable ex$) {
                        throw new AssertionError("should not reach here", ex$);
                    }
                }
            }

            private static final AddressLayout free$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("free"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionState *)
             * }
             */
            public static final AddressLayout free$layout() {
                return free$LAYOUT;
            }

            private static final long free$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionState *)
             * }
             */
            public static final long free$offset() {
                return free$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionState *)
             * }
             */
            public static MemorySegment free(MemorySegment struct) {
                return struct.get(free$LAYOUT, free$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_IntersectionState *)
             * }
             */
            public static void free(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(free$LAYOUT, free$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout list$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("list"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionState **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionState *);
         * } list
         * }
         */
        public static final GroupLayout list$layout() {
            return list$LAYOUT;
        }

        private static final long list$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionState **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionState *);
         * } list
         * }
         */
        public static final long list$offset() {
            return list$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionState **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionState *);
         * } list
         * }
         */
        public static MemorySegment list(MemorySegment struct) {
            return struct.asSlice(list$OFFSET, list$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_IntersectionState **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_IntersectionState *);
         * } list
         * }
         */
        public static void list(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, list$OFFSET, list$LAYOUT.byteSize());
        }

        private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final GroupLayout _asn_ctx$layout() {
            return _asn_ctx$LAYOUT;
        }

        private static final long _asn_ctx$OFFSET = 24;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final long _asn_ctx$offset() {
            return _asn_ctx$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static MemorySegment _asn_ctx(MemorySegment struct) {
            return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final AddressLayout regional$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("regional"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct IntersectionState__regional *regional
     * }
     */
    public static final AddressLayout regional$layout() {
        return regional$LAYOUT;
    }

    private static final long regional$OFFSET = 184;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct IntersectionState__regional *regional
     * }
     */
    public static final long regional$offset() {
        return regional$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct IntersectionState__regional *regional
     * }
     */
    public static MemorySegment regional(MemorySegment struct) {
        return struct.get(regional$LAYOUT, regional$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct IntersectionState__regional *regional
     * }
     */
    public static void regional(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(regional$LAYOUT, regional$OFFSET, fieldValue);
    }

    private static final AddressLayout roadAuthorityID$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("roadAuthorityID"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static final AddressLayout roadAuthorityID$layout() {
        return roadAuthorityID$LAYOUT;
    }

    private static final long roadAuthorityID$OFFSET = 192;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static final long roadAuthorityID$offset() {
        return roadAuthorityID$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static MemorySegment roadAuthorityID(MemorySegment struct) {
        return struct.get(roadAuthorityID$LAYOUT, roadAuthorityID$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct RoadAuthorityID *roadAuthorityID
     * }
     */
    public static void roadAuthorityID(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(roadAuthorityID$LAYOUT, roadAuthorityID$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 200;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
