// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct IntersectionAccessPoint {
 *     IntersectionAccessPoint_PR present;
 *     union IntersectionAccessPoint_u {
 *         LaneID_t lane;
 *         ApproachID_t approach;
 *         LaneConnectionID_t connection;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class IntersectionAccessPoint {

    IntersectionAccessPoint() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        MemoryLayout.paddingLayout(4),
        IntersectionAccessPoint_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("IntersectionAccessPoint");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * IntersectionAccessPoint_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * IntersectionAccessPoint_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * IntersectionAccessPoint_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * IntersectionAccessPoint_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union IntersectionAccessPoint_u {
     *     LaneID_t lane;
     *     ApproachID_t approach;
     *     LaneConnectionID_t connection;
     * }
     * }
     */
    public static class IntersectionAccessPoint_u {

        IntersectionAccessPoint_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            MessageFrame_h.C_LONG.withName("lane"),
            MessageFrame_h.C_LONG.withName("approach"),
            MessageFrame_h.C_LONG.withName("connection")
        ).withName("IntersectionAccessPoint_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfLong lane$LAYOUT = (OfLong)$LAYOUT.select(groupElement("lane"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * LaneID_t lane
         * }
         */
        public static final OfLong lane$layout() {
            return lane$LAYOUT;
        }

        private static final long lane$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * LaneID_t lane
         * }
         */
        public static final long lane$offset() {
            return lane$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * LaneID_t lane
         * }
         */
        public static long lane(MemorySegment union) {
            return union.get(lane$LAYOUT, lane$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * LaneID_t lane
         * }
         */
        public static void lane(MemorySegment union, long fieldValue) {
            union.set(lane$LAYOUT, lane$OFFSET, fieldValue);
        }

        private static final OfLong approach$LAYOUT = (OfLong)$LAYOUT.select(groupElement("approach"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * ApproachID_t approach
         * }
         */
        public static final OfLong approach$layout() {
            return approach$LAYOUT;
        }

        private static final long approach$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * ApproachID_t approach
         * }
         */
        public static final long approach$offset() {
            return approach$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * ApproachID_t approach
         * }
         */
        public static long approach(MemorySegment union) {
            return union.get(approach$LAYOUT, approach$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * ApproachID_t approach
         * }
         */
        public static void approach(MemorySegment union, long fieldValue) {
            union.set(approach$LAYOUT, approach$OFFSET, fieldValue);
        }

        private static final OfLong connection$LAYOUT = (OfLong)$LAYOUT.select(groupElement("connection"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * LaneConnectionID_t connection
         * }
         */
        public static final OfLong connection$layout() {
            return connection$LAYOUT;
        }

        private static final long connection$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * LaneConnectionID_t connection
         * }
         */
        public static final long connection$offset() {
            return connection$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * LaneConnectionID_t connection
         * }
         */
        public static long connection(MemorySegment union) {
            return union.get(connection$LAYOUT, connection$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * LaneConnectionID_t connection
         * }
         */
        public static void connection(MemorySegment union, long fieldValue) {
            union.set(connection$LAYOUT, connection$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union IntersectionAccessPoint_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union IntersectionAccessPoint_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union IntersectionAccessPoint_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union IntersectionAccessPoint_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

