// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct PerAxleWeightCharges {
 *     long totalWeightLimit;
 *     long maxLadenWeightOnAxle;
 *     long weightLimitUnits;
 *     PaymentFee_t axleWeightCharge;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class PerAxleWeightCharges {

    PerAxleWeightCharges() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("totalWeightLimit"),
        MessageFrame_h.C_LONG.withName("maxLadenWeightOnAxle"),
        MessageFrame_h.C_LONG.withName("weightLimitUnits"),
        PaymentFee.layout().withName("axleWeightCharge"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("PerAxleWeightCharges");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong totalWeightLimit$LAYOUT = (OfLong)$LAYOUT.select(groupElement("totalWeightLimit"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long totalWeightLimit
     * }
     */
    public static final OfLong totalWeightLimit$layout() {
        return totalWeightLimit$LAYOUT;
    }

    private static final long totalWeightLimit$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long totalWeightLimit
     * }
     */
    public static final long totalWeightLimit$offset() {
        return totalWeightLimit$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long totalWeightLimit
     * }
     */
    public static long totalWeightLimit(MemorySegment struct) {
        return struct.get(totalWeightLimit$LAYOUT, totalWeightLimit$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long totalWeightLimit
     * }
     */
    public static void totalWeightLimit(MemorySegment struct, long fieldValue) {
        struct.set(totalWeightLimit$LAYOUT, totalWeightLimit$OFFSET, fieldValue);
    }

    private static final OfLong maxLadenWeightOnAxle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxLadenWeightOnAxle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long maxLadenWeightOnAxle
     * }
     */
    public static final OfLong maxLadenWeightOnAxle$layout() {
        return maxLadenWeightOnAxle$LAYOUT;
    }

    private static final long maxLadenWeightOnAxle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long maxLadenWeightOnAxle
     * }
     */
    public static final long maxLadenWeightOnAxle$offset() {
        return maxLadenWeightOnAxle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long maxLadenWeightOnAxle
     * }
     */
    public static long maxLadenWeightOnAxle(MemorySegment struct) {
        return struct.get(maxLadenWeightOnAxle$LAYOUT, maxLadenWeightOnAxle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long maxLadenWeightOnAxle
     * }
     */
    public static void maxLadenWeightOnAxle(MemorySegment struct, long fieldValue) {
        struct.set(maxLadenWeightOnAxle$LAYOUT, maxLadenWeightOnAxle$OFFSET, fieldValue);
    }

    private static final OfLong weightLimitUnits$LAYOUT = (OfLong)$LAYOUT.select(groupElement("weightLimitUnits"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long weightLimitUnits
     * }
     */
    public static final OfLong weightLimitUnits$layout() {
        return weightLimitUnits$LAYOUT;
    }

    private static final long weightLimitUnits$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long weightLimitUnits
     * }
     */
    public static final long weightLimitUnits$offset() {
        return weightLimitUnits$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long weightLimitUnits
     * }
     */
    public static long weightLimitUnits(MemorySegment struct) {
        return struct.get(weightLimitUnits$LAYOUT, weightLimitUnits$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long weightLimitUnits
     * }
     */
    public static void weightLimitUnits(MemorySegment struct, long fieldValue) {
        struct.set(weightLimitUnits$LAYOUT, weightLimitUnits$OFFSET, fieldValue);
    }

    private static final GroupLayout axleWeightCharge$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("axleWeightCharge"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PaymentFee_t axleWeightCharge
     * }
     */
    public static final GroupLayout axleWeightCharge$layout() {
        return axleWeightCharge$LAYOUT;
    }

    private static final long axleWeightCharge$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PaymentFee_t axleWeightCharge
     * }
     */
    public static final long axleWeightCharge$offset() {
        return axleWeightCharge$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PaymentFee_t axleWeightCharge
     * }
     */
    public static MemorySegment axleWeightCharge(MemorySegment struct) {
        return struct.asSlice(axleWeightCharge$OFFSET, axleWeightCharge$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PaymentFee_t axleWeightCharge
     * }
     */
    public static void axleWeightCharge(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, axleWeightCharge$OFFSET, axleWeightCharge$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

