// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct PivotPointDescription {
 *     Offset_B11_t pivotOffset;
 *     Common_Angle_t pivotAngle;
 *     PivotingAllowed_t pivots;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class PivotPointDescription {

    PivotPointDescription() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("pivotOffset"),
        MessageFrame_h.C_LONG.withName("pivotAngle"),
        MessageFrame_h.C_INT.withName("pivots"),
        MemoryLayout.paddingLayout(4),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("PivotPointDescription");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong pivotOffset$LAYOUT = (OfLong)$LAYOUT.select(groupElement("pivotOffset"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Offset_B11_t pivotOffset
     * }
     */
    public static final OfLong pivotOffset$layout() {
        return pivotOffset$LAYOUT;
    }

    private static final long pivotOffset$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Offset_B11_t pivotOffset
     * }
     */
    public static final long pivotOffset$offset() {
        return pivotOffset$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Offset_B11_t pivotOffset
     * }
     */
    public static long pivotOffset(MemorySegment struct) {
        return struct.get(pivotOffset$LAYOUT, pivotOffset$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Offset_B11_t pivotOffset
     * }
     */
    public static void pivotOffset(MemorySegment struct, long fieldValue) {
        struct.set(pivotOffset$LAYOUT, pivotOffset$OFFSET, fieldValue);
    }

    private static final OfLong pivotAngle$LAYOUT = (OfLong)$LAYOUT.select(groupElement("pivotAngle"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Common_Angle_t pivotAngle
     * }
     */
    public static final OfLong pivotAngle$layout() {
        return pivotAngle$LAYOUT;
    }

    private static final long pivotAngle$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Common_Angle_t pivotAngle
     * }
     */
    public static final long pivotAngle$offset() {
        return pivotAngle$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Common_Angle_t pivotAngle
     * }
     */
    public static long pivotAngle(MemorySegment struct) {
        return struct.get(pivotAngle$LAYOUT, pivotAngle$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Common_Angle_t pivotAngle
     * }
     */
    public static void pivotAngle(MemorySegment struct, long fieldValue) {
        struct.set(pivotAngle$LAYOUT, pivotAngle$OFFSET, fieldValue);
    }

    private static final OfInt pivots$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pivots"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * PivotingAllowed_t pivots
     * }
     */
    public static final OfInt pivots$layout() {
        return pivots$LAYOUT;
    }

    private static final long pivots$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * PivotingAllowed_t pivots
     * }
     */
    public static final long pivots$offset() {
        return pivots$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * PivotingAllowed_t pivots
     * }
     */
    public static int pivots(MemorySegment struct) {
        return struct.get(pivots$LAYOUT, pivots$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * PivotingAllowed_t pivots
     * }
     */
    public static void pivots(MemorySegment struct, int fieldValue) {
        struct.set(pivots$LAYOUT, pivots$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

