// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct ProbeDataConfig {
 *     ConfigDescriptor_t descriptor;
 *     ConfigTriggers_t triggers;
 *     long maxAgeOfData;
 *     struct ConfigBoundary *boundary;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class ProbeDataConfig {

    ProbeDataConfig() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        ConfigDescriptor.layout().withName("descriptor"),
        ConfigTriggers.layout().withName("triggers"),
        MessageFrame_h.C_LONG.withName("maxAgeOfData"),
        MessageFrame_h.C_POINTER.withName("boundary"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("ProbeDataConfig");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final GroupLayout descriptor$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("descriptor"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ConfigDescriptor_t descriptor
     * }
     */
    public static final GroupLayout descriptor$layout() {
        return descriptor$LAYOUT;
    }

    private static final long descriptor$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ConfigDescriptor_t descriptor
     * }
     */
    public static final long descriptor$offset() {
        return descriptor$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ConfigDescriptor_t descriptor
     * }
     */
    public static MemorySegment descriptor(MemorySegment struct) {
        return struct.asSlice(descriptor$OFFSET, descriptor$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ConfigDescriptor_t descriptor
     * }
     */
    public static void descriptor(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, descriptor$OFFSET, descriptor$LAYOUT.byteSize());
    }

    private static final GroupLayout triggers$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("triggers"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ConfigTriggers_t triggers
     * }
     */
    public static final GroupLayout triggers$layout() {
        return triggers$LAYOUT;
    }

    private static final long triggers$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ConfigTriggers_t triggers
     * }
     */
    public static final long triggers$offset() {
        return triggers$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ConfigTriggers_t triggers
     * }
     */
    public static MemorySegment triggers(MemorySegment struct) {
        return struct.asSlice(triggers$OFFSET, triggers$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ConfigTriggers_t triggers
     * }
     */
    public static void triggers(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, triggers$OFFSET, triggers$LAYOUT.byteSize());
    }

    private static final OfLong maxAgeOfData$LAYOUT = (OfLong)$LAYOUT.select(groupElement("maxAgeOfData"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * long maxAgeOfData
     * }
     */
    public static final OfLong maxAgeOfData$layout() {
        return maxAgeOfData$LAYOUT;
    }

    private static final long maxAgeOfData$OFFSET = 240;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * long maxAgeOfData
     * }
     */
    public static final long maxAgeOfData$offset() {
        return maxAgeOfData$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * long maxAgeOfData
     * }
     */
    public static long maxAgeOfData(MemorySegment struct) {
        return struct.get(maxAgeOfData$LAYOUT, maxAgeOfData$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * long maxAgeOfData
     * }
     */
    public static void maxAgeOfData(MemorySegment struct, long fieldValue) {
        struct.set(maxAgeOfData$LAYOUT, maxAgeOfData$OFFSET, fieldValue);
    }

    private static final AddressLayout boundary$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("boundary"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct ConfigBoundary *boundary
     * }
     */
    public static final AddressLayout boundary$layout() {
        return boundary$LAYOUT;
    }

    private static final long boundary$OFFSET = 248;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct ConfigBoundary *boundary
     * }
     */
    public static final long boundary$offset() {
        return boundary$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct ConfigBoundary *boundary
     * }
     */
    public static MemorySegment boundary(MemorySegment struct) {
        return struct.get(boundary$LAYOUT, boundary$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct ConfigBoundary *boundary
     * }
     */
    public static void boundary(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(boundary$LAYOUT, boundary$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 256;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

