// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RptEvents {
 *     RptEvents_PR present;
 *     union RptEvents_u {
 *         BOOLEAN_t absActive;
 *         BOOLEAN_t tractionCtlLoss;
 *         BOOLEAN_t stabilityCtlActive;
 *         BOOLEAN_t hardBraking;
 *         BOOLEAN_t swerve;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class RptEvents {

    RptEvents() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        RptEvents_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("RptEvents");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RptEvents_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RptEvents_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RptEvents_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RptEvents_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union RptEvents_u {
     *     BOOLEAN_t absActive;
     *     BOOLEAN_t tractionCtlLoss;
     *     BOOLEAN_t stabilityCtlActive;
     *     BOOLEAN_t hardBraking;
     *     BOOLEAN_t swerve;
     * }
     * }
     */
    public static class RptEvents_u {

        RptEvents_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            MessageFrame_h.C_INT.withName("absActive"),
            MessageFrame_h.C_INT.withName("tractionCtlLoss"),
            MessageFrame_h.C_INT.withName("stabilityCtlActive"),
            MessageFrame_h.C_INT.withName("hardBraking"),
            MessageFrame_h.C_INT.withName("swerve")
        ).withName("RptEvents_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt absActive$LAYOUT = (OfInt)$LAYOUT.select(groupElement("absActive"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * BOOLEAN_t absActive
         * }
         */
        public static final OfInt absActive$layout() {
            return absActive$LAYOUT;
        }

        private static final long absActive$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * BOOLEAN_t absActive
         * }
         */
        public static final long absActive$offset() {
            return absActive$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * BOOLEAN_t absActive
         * }
         */
        public static int absActive(MemorySegment union) {
            return union.get(absActive$LAYOUT, absActive$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * BOOLEAN_t absActive
         * }
         */
        public static void absActive(MemorySegment union, int fieldValue) {
            union.set(absActive$LAYOUT, absActive$OFFSET, fieldValue);
        }

        private static final OfInt tractionCtlLoss$LAYOUT = (OfInt)$LAYOUT.select(groupElement("tractionCtlLoss"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * BOOLEAN_t tractionCtlLoss
         * }
         */
        public static final OfInt tractionCtlLoss$layout() {
            return tractionCtlLoss$LAYOUT;
        }

        private static final long tractionCtlLoss$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * BOOLEAN_t tractionCtlLoss
         * }
         */
        public static final long tractionCtlLoss$offset() {
            return tractionCtlLoss$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * BOOLEAN_t tractionCtlLoss
         * }
         */
        public static int tractionCtlLoss(MemorySegment union) {
            return union.get(tractionCtlLoss$LAYOUT, tractionCtlLoss$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * BOOLEAN_t tractionCtlLoss
         * }
         */
        public static void tractionCtlLoss(MemorySegment union, int fieldValue) {
            union.set(tractionCtlLoss$LAYOUT, tractionCtlLoss$OFFSET, fieldValue);
        }

        private static final OfInt stabilityCtlActive$LAYOUT = (OfInt)$LAYOUT.select(groupElement("stabilityCtlActive"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * BOOLEAN_t stabilityCtlActive
         * }
         */
        public static final OfInt stabilityCtlActive$layout() {
            return stabilityCtlActive$LAYOUT;
        }

        private static final long stabilityCtlActive$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * BOOLEAN_t stabilityCtlActive
         * }
         */
        public static final long stabilityCtlActive$offset() {
            return stabilityCtlActive$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * BOOLEAN_t stabilityCtlActive
         * }
         */
        public static int stabilityCtlActive(MemorySegment union) {
            return union.get(stabilityCtlActive$LAYOUT, stabilityCtlActive$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * BOOLEAN_t stabilityCtlActive
         * }
         */
        public static void stabilityCtlActive(MemorySegment union, int fieldValue) {
            union.set(stabilityCtlActive$LAYOUT, stabilityCtlActive$OFFSET, fieldValue);
        }

        private static final OfInt hardBraking$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hardBraking"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * BOOLEAN_t hardBraking
         * }
         */
        public static final OfInt hardBraking$layout() {
            return hardBraking$LAYOUT;
        }

        private static final long hardBraking$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * BOOLEAN_t hardBraking
         * }
         */
        public static final long hardBraking$offset() {
            return hardBraking$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * BOOLEAN_t hardBraking
         * }
         */
        public static int hardBraking(MemorySegment union) {
            return union.get(hardBraking$LAYOUT, hardBraking$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * BOOLEAN_t hardBraking
         * }
         */
        public static void hardBraking(MemorySegment union, int fieldValue) {
            union.set(hardBraking$LAYOUT, hardBraking$OFFSET, fieldValue);
        }

        private static final OfInt swerve$LAYOUT = (OfInt)$LAYOUT.select(groupElement("swerve"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * BOOLEAN_t swerve
         * }
         */
        public static final OfInt swerve$layout() {
            return swerve$LAYOUT;
        }

        private static final long swerve$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * BOOLEAN_t swerve
         * }
         */
        public static final long swerve$offset() {
            return swerve$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * BOOLEAN_t swerve
         * }
         */
        public static int swerve(MemorySegment union) {
            return union.get(swerve$LAYOUT, swerve$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * BOOLEAN_t swerve
         * }
         */
        public static void swerve(MemorySegment union, int fieldValue) {
            union.set(swerve$LAYOUT, swerve$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union RptEvents_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union RptEvents_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union RptEvents_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union RptEvents_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

