// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RptInstantaneousRecordData {
 *     RptInstantaneousRecordData_PR present;
 *     union RptInstantaneousRecordData_u {
 *         RptIntervalEvents_t intervalEvents;
 *         RptVehicleEvents_t vehEvents;
 *         RptRoadwayEvents_t roadwayEvents;
 *         RptCommSysPerfEvents_t commSysPerfEvents;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class RptInstantaneousRecordData {

    RptInstantaneousRecordData() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        MemoryLayout.paddingLayout(4),
        RptInstantaneousRecordData_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("RptInstantaneousRecordData");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RptInstantaneousRecordData_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RptInstantaneousRecordData_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RptInstantaneousRecordData_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RptInstantaneousRecordData_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union RptInstantaneousRecordData_u {
     *     RptIntervalEvents_t intervalEvents;
     *     RptVehicleEvents_t vehEvents;
     *     RptRoadwayEvents_t roadwayEvents;
     *     RptCommSysPerfEvents_t commSysPerfEvents;
     * }
     * }
     */
    public static class RptInstantaneousRecordData_u {

        RptInstantaneousRecordData_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            RptIntervalEvents.layout().withName("intervalEvents"),
            RptVehicleEvents.layout().withName("vehEvents"),
            RptRoadwayEvents.layout().withName("roadwayEvents"),
            RptCommSysPerfEvents.layout().withName("commSysPerfEvents")
        ).withName("RptInstantaneousRecordData_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final GroupLayout intervalEvents$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("intervalEvents"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptIntervalEvents_t intervalEvents
         * }
         */
        public static final GroupLayout intervalEvents$layout() {
            return intervalEvents$LAYOUT;
        }

        private static final long intervalEvents$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptIntervalEvents_t intervalEvents
         * }
         */
        public static final long intervalEvents$offset() {
            return intervalEvents$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptIntervalEvents_t intervalEvents
         * }
         */
        public static MemorySegment intervalEvents(MemorySegment union) {
            return union.asSlice(intervalEvents$OFFSET, intervalEvents$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptIntervalEvents_t intervalEvents
         * }
         */
        public static void intervalEvents(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, intervalEvents$OFFSET, intervalEvents$LAYOUT.byteSize());
        }

        private static final GroupLayout vehEvents$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("vehEvents"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptVehicleEvents_t vehEvents
         * }
         */
        public static final GroupLayout vehEvents$layout() {
            return vehEvents$LAYOUT;
        }

        private static final long vehEvents$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptVehicleEvents_t vehEvents
         * }
         */
        public static final long vehEvents$offset() {
            return vehEvents$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptVehicleEvents_t vehEvents
         * }
         */
        public static MemorySegment vehEvents(MemorySegment union) {
            return union.asSlice(vehEvents$OFFSET, vehEvents$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptVehicleEvents_t vehEvents
         * }
         */
        public static void vehEvents(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, vehEvents$OFFSET, vehEvents$LAYOUT.byteSize());
        }

        private static final GroupLayout roadwayEvents$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("roadwayEvents"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptRoadwayEvents_t roadwayEvents
         * }
         */
        public static final GroupLayout roadwayEvents$layout() {
            return roadwayEvents$LAYOUT;
        }

        private static final long roadwayEvents$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptRoadwayEvents_t roadwayEvents
         * }
         */
        public static final long roadwayEvents$offset() {
            return roadwayEvents$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptRoadwayEvents_t roadwayEvents
         * }
         */
        public static MemorySegment roadwayEvents(MemorySegment union) {
            return union.asSlice(roadwayEvents$OFFSET, roadwayEvents$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptRoadwayEvents_t roadwayEvents
         * }
         */
        public static void roadwayEvents(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, roadwayEvents$OFFSET, roadwayEvents$LAYOUT.byteSize());
        }

        private static final GroupLayout commSysPerfEvents$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("commSysPerfEvents"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptCommSysPerfEvents_t commSysPerfEvents
         * }
         */
        public static final GroupLayout commSysPerfEvents$layout() {
            return commSysPerfEvents$LAYOUT;
        }

        private static final long commSysPerfEvents$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptCommSysPerfEvents_t commSysPerfEvents
         * }
         */
        public static final long commSysPerfEvents$offset() {
            return commSysPerfEvents$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptCommSysPerfEvents_t commSysPerfEvents
         * }
         */
        public static MemorySegment commSysPerfEvents(MemorySegment union) {
            return union.asSlice(commSysPerfEvents$OFFSET, commSysPerfEvents$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptCommSysPerfEvents_t commSysPerfEvents
         * }
         */
        public static void commSysPerfEvents(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, commSysPerfEvents$OFFSET, commSysPerfEvents$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union RptInstantaneousRecordData_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union RptInstantaneousRecordData_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union RptInstantaneousRecordData_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union RptInstantaneousRecordData_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 104;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

