// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RptTrafficMetrics {
 *     RptTrafficMetrics_PR present;
 *     union RptTrafficMetrics_u {
 *         NULL_t trfsigApproachDelay;
 *         NULL_t trfsigApproachSpeed;
 *         NULL_t trfsigArrivalGreen;
 *         NULL_t trfsigArrivalRed;
 *         NULL_t trfsigPedDelay;
 *         NULL_t trfsigSpatMismatch;
 *         NULL_t trfsigSpatTimingError;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class RptTrafficMetrics {

    RptTrafficMetrics() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        RptTrafficMetrics_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("RptTrafficMetrics");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RptTrafficMetrics_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RptTrafficMetrics_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RptTrafficMetrics_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RptTrafficMetrics_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union RptTrafficMetrics_u {
     *     NULL_t trfsigApproachDelay;
     *     NULL_t trfsigApproachSpeed;
     *     NULL_t trfsigArrivalGreen;
     *     NULL_t trfsigArrivalRed;
     *     NULL_t trfsigPedDelay;
     *     NULL_t trfsigSpatMismatch;
     *     NULL_t trfsigSpatTimingError;
     * }
     * }
     */
    public static class RptTrafficMetrics_u {

        RptTrafficMetrics_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            MessageFrame_h.C_INT.withName("trfsigApproachDelay"),
            MessageFrame_h.C_INT.withName("trfsigApproachSpeed"),
            MessageFrame_h.C_INT.withName("trfsigArrivalGreen"),
            MessageFrame_h.C_INT.withName("trfsigArrivalRed"),
            MessageFrame_h.C_INT.withName("trfsigPedDelay"),
            MessageFrame_h.C_INT.withName("trfsigSpatMismatch"),
            MessageFrame_h.C_INT.withName("trfsigSpatTimingError")
        ).withName("RptTrafficMetrics_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt trfsigApproachDelay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigApproachDelay"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachDelay
         * }
         */
        public static final OfInt trfsigApproachDelay$layout() {
            return trfsigApproachDelay$LAYOUT;
        }

        private static final long trfsigApproachDelay$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachDelay
         * }
         */
        public static final long trfsigApproachDelay$offset() {
            return trfsigApproachDelay$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachDelay
         * }
         */
        public static int trfsigApproachDelay(MemorySegment union) {
            return union.get(trfsigApproachDelay$LAYOUT, trfsigApproachDelay$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachDelay
         * }
         */
        public static void trfsigApproachDelay(MemorySegment union, int fieldValue) {
            union.set(trfsigApproachDelay$LAYOUT, trfsigApproachDelay$OFFSET, fieldValue);
        }

        private static final OfInt trfsigApproachSpeed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigApproachSpeed"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachSpeed
         * }
         */
        public static final OfInt trfsigApproachSpeed$layout() {
            return trfsigApproachSpeed$LAYOUT;
        }

        private static final long trfsigApproachSpeed$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachSpeed
         * }
         */
        public static final long trfsigApproachSpeed$offset() {
            return trfsigApproachSpeed$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachSpeed
         * }
         */
        public static int trfsigApproachSpeed(MemorySegment union) {
            return union.get(trfsigApproachSpeed$LAYOUT, trfsigApproachSpeed$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigApproachSpeed
         * }
         */
        public static void trfsigApproachSpeed(MemorySegment union, int fieldValue) {
            union.set(trfsigApproachSpeed$LAYOUT, trfsigApproachSpeed$OFFSET, fieldValue);
        }

        private static final OfInt trfsigArrivalGreen$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigArrivalGreen"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalGreen
         * }
         */
        public static final OfInt trfsigArrivalGreen$layout() {
            return trfsigArrivalGreen$LAYOUT;
        }

        private static final long trfsigArrivalGreen$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalGreen
         * }
         */
        public static final long trfsigArrivalGreen$offset() {
            return trfsigArrivalGreen$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalGreen
         * }
         */
        public static int trfsigArrivalGreen(MemorySegment union) {
            return union.get(trfsigArrivalGreen$LAYOUT, trfsigArrivalGreen$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalGreen
         * }
         */
        public static void trfsigArrivalGreen(MemorySegment union, int fieldValue) {
            union.set(trfsigArrivalGreen$LAYOUT, trfsigArrivalGreen$OFFSET, fieldValue);
        }

        private static final OfInt trfsigArrivalRed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigArrivalRed"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalRed
         * }
         */
        public static final OfInt trfsigArrivalRed$layout() {
            return trfsigArrivalRed$LAYOUT;
        }

        private static final long trfsigArrivalRed$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalRed
         * }
         */
        public static final long trfsigArrivalRed$offset() {
            return trfsigArrivalRed$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalRed
         * }
         */
        public static int trfsigArrivalRed(MemorySegment union) {
            return union.get(trfsigArrivalRed$LAYOUT, trfsigArrivalRed$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigArrivalRed
         * }
         */
        public static void trfsigArrivalRed(MemorySegment union, int fieldValue) {
            union.set(trfsigArrivalRed$LAYOUT, trfsigArrivalRed$OFFSET, fieldValue);
        }

        private static final OfInt trfsigPedDelay$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigPedDelay"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigPedDelay
         * }
         */
        public static final OfInt trfsigPedDelay$layout() {
            return trfsigPedDelay$LAYOUT;
        }

        private static final long trfsigPedDelay$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigPedDelay
         * }
         */
        public static final long trfsigPedDelay$offset() {
            return trfsigPedDelay$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigPedDelay
         * }
         */
        public static int trfsigPedDelay(MemorySegment union) {
            return union.get(trfsigPedDelay$LAYOUT, trfsigPedDelay$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigPedDelay
         * }
         */
        public static void trfsigPedDelay(MemorySegment union, int fieldValue) {
            union.set(trfsigPedDelay$LAYOUT, trfsigPedDelay$OFFSET, fieldValue);
        }

        private static final OfInt trfsigSpatMismatch$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigSpatMismatch"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatMismatch
         * }
         */
        public static final OfInt trfsigSpatMismatch$layout() {
            return trfsigSpatMismatch$LAYOUT;
        }

        private static final long trfsigSpatMismatch$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatMismatch
         * }
         */
        public static final long trfsigSpatMismatch$offset() {
            return trfsigSpatMismatch$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatMismatch
         * }
         */
        public static int trfsigSpatMismatch(MemorySegment union) {
            return union.get(trfsigSpatMismatch$LAYOUT, trfsigSpatMismatch$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatMismatch
         * }
         */
        public static void trfsigSpatMismatch(MemorySegment union, int fieldValue) {
            union.set(trfsigSpatMismatch$LAYOUT, trfsigSpatMismatch$OFFSET, fieldValue);
        }

        private static final OfInt trfsigSpatTimingError$LAYOUT = (OfInt)$LAYOUT.select(groupElement("trfsigSpatTimingError"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatTimingError
         * }
         */
        public static final OfInt trfsigSpatTimingError$layout() {
            return trfsigSpatTimingError$LAYOUT;
        }

        private static final long trfsigSpatTimingError$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatTimingError
         * }
         */
        public static final long trfsigSpatTimingError$offset() {
            return trfsigSpatTimingError$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatTimingError
         * }
         */
        public static int trfsigSpatTimingError(MemorySegment union) {
            return union.get(trfsigSpatTimingError$LAYOUT, trfsigSpatTimingError$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t trfsigSpatTimingError
         * }
         */
        public static void trfsigSpatTimingError(MemorySegment union, int fieldValue) {
            union.set(trfsigSpatTimingError$LAYOUT, trfsigSpatTimingError$OFFSET, fieldValue);
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union RptTrafficMetrics_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union RptTrafficMetrics_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union RptTrafficMetrics_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union RptTrafficMetrics_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

