// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct RptVehicleEvents {
 *     RptVehicleEvents_PR present;
 *     union RptVehicleEvents_u {
 *         NULL_t headLights;
 *         NULL_t fogLights;
 *         NULL_t hazardLights;
 *         RptKinematicEvents_t kinematicEvents;
 *         NULL_t wiperStatusChange;
 *         NULL_t lowSpeed;
 *         NULL_t resumedSpeed;
 *         NULL_t vehEntrsExitsRegion;
 *         NULL_t emerVehDetect;
 *         NULL_t emerVehLightBar;
 *         NULL_t reqTspEvp;
 *         NULL_t transitVehPassCnt;
 *         NULL_t transitVehDoor;
 *         NULL_t v2xMsgRecption;
 *         RptDriverAlertsAndWarnings_t driverAlertsAndWarnings;
 *     } choice;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class RptVehicleEvents {

    RptVehicleEvents() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_INT.withName("present"),
        MemoryLayout.paddingLayout(4),
        RptVehicleEvents_u.layout().withName("choice"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("RptVehicleEvents");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt present$LAYOUT = (OfInt)$LAYOUT.select(groupElement("present"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * RptVehicleEvents_PR present
     * }
     */
    public static final OfInt present$layout() {
        return present$LAYOUT;
    }

    private static final long present$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * RptVehicleEvents_PR present
     * }
     */
    public static final long present$offset() {
        return present$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * RptVehicleEvents_PR present
     * }
     */
    public static int present(MemorySegment struct) {
        return struct.get(present$LAYOUT, present$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * RptVehicleEvents_PR present
     * }
     */
    public static void present(MemorySegment struct, int fieldValue) {
        struct.set(present$LAYOUT, present$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * union RptVehicleEvents_u {
     *     NULL_t headLights;
     *     NULL_t fogLights;
     *     NULL_t hazardLights;
     *     RptKinematicEvents_t kinematicEvents;
     *     NULL_t wiperStatusChange;
     *     NULL_t lowSpeed;
     *     NULL_t resumedSpeed;
     *     NULL_t vehEntrsExitsRegion;
     *     NULL_t emerVehDetect;
     *     NULL_t emerVehLightBar;
     *     NULL_t reqTspEvp;
     *     NULL_t transitVehPassCnt;
     *     NULL_t transitVehDoor;
     *     NULL_t v2xMsgRecption;
     *     RptDriverAlertsAndWarnings_t driverAlertsAndWarnings;
     * }
     * }
     */
    public static class RptVehicleEvents_u {

        RptVehicleEvents_u() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.unionLayout(
            MessageFrame_h.C_INT.withName("headLights"),
            MessageFrame_h.C_INT.withName("fogLights"),
            MessageFrame_h.C_INT.withName("hazardLights"),
            RptKinematicEvents.layout().withName("kinematicEvents"),
            MessageFrame_h.C_INT.withName("wiperStatusChange"),
            MessageFrame_h.C_INT.withName("lowSpeed"),
            MessageFrame_h.C_INT.withName("resumedSpeed"),
            MessageFrame_h.C_INT.withName("vehEntrsExitsRegion"),
            MessageFrame_h.C_INT.withName("emerVehDetect"),
            MessageFrame_h.C_INT.withName("emerVehLightBar"),
            MessageFrame_h.C_INT.withName("reqTspEvp"),
            MessageFrame_h.C_INT.withName("transitVehPassCnt"),
            MessageFrame_h.C_INT.withName("transitVehDoor"),
            MessageFrame_h.C_INT.withName("v2xMsgRecption"),
            RptDriverAlertsAndWarnings.layout().withName("driverAlertsAndWarnings")
        ).withName("RptVehicleEvents_u");

        /**
         * The layout of this union
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        private static final OfInt headLights$LAYOUT = (OfInt)$LAYOUT.select(groupElement("headLights"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t headLights
         * }
         */
        public static final OfInt headLights$layout() {
            return headLights$LAYOUT;
        }

        private static final long headLights$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t headLights
         * }
         */
        public static final long headLights$offset() {
            return headLights$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t headLights
         * }
         */
        public static int headLights(MemorySegment union) {
            return union.get(headLights$LAYOUT, headLights$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t headLights
         * }
         */
        public static void headLights(MemorySegment union, int fieldValue) {
            union.set(headLights$LAYOUT, headLights$OFFSET, fieldValue);
        }

        private static final OfInt fogLights$LAYOUT = (OfInt)$LAYOUT.select(groupElement("fogLights"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t fogLights
         * }
         */
        public static final OfInt fogLights$layout() {
            return fogLights$LAYOUT;
        }

        private static final long fogLights$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t fogLights
         * }
         */
        public static final long fogLights$offset() {
            return fogLights$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t fogLights
         * }
         */
        public static int fogLights(MemorySegment union) {
            return union.get(fogLights$LAYOUT, fogLights$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t fogLights
         * }
         */
        public static void fogLights(MemorySegment union, int fieldValue) {
            union.set(fogLights$LAYOUT, fogLights$OFFSET, fieldValue);
        }

        private static final OfInt hazardLights$LAYOUT = (OfInt)$LAYOUT.select(groupElement("hazardLights"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t hazardLights
         * }
         */
        public static final OfInt hazardLights$layout() {
            return hazardLights$LAYOUT;
        }

        private static final long hazardLights$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t hazardLights
         * }
         */
        public static final long hazardLights$offset() {
            return hazardLights$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t hazardLights
         * }
         */
        public static int hazardLights(MemorySegment union) {
            return union.get(hazardLights$LAYOUT, hazardLights$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t hazardLights
         * }
         */
        public static void hazardLights(MemorySegment union, int fieldValue) {
            union.set(hazardLights$LAYOUT, hazardLights$OFFSET, fieldValue);
        }

        private static final GroupLayout kinematicEvents$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("kinematicEvents"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptKinematicEvents_t kinematicEvents
         * }
         */
        public static final GroupLayout kinematicEvents$layout() {
            return kinematicEvents$LAYOUT;
        }

        private static final long kinematicEvents$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptKinematicEvents_t kinematicEvents
         * }
         */
        public static final long kinematicEvents$offset() {
            return kinematicEvents$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptKinematicEvents_t kinematicEvents
         * }
         */
        public static MemorySegment kinematicEvents(MemorySegment union) {
            return union.asSlice(kinematicEvents$OFFSET, kinematicEvents$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptKinematicEvents_t kinematicEvents
         * }
         */
        public static void kinematicEvents(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, kinematicEvents$OFFSET, kinematicEvents$LAYOUT.byteSize());
        }

        private static final OfInt wiperStatusChange$LAYOUT = (OfInt)$LAYOUT.select(groupElement("wiperStatusChange"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t wiperStatusChange
         * }
         */
        public static final OfInt wiperStatusChange$layout() {
            return wiperStatusChange$LAYOUT;
        }

        private static final long wiperStatusChange$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t wiperStatusChange
         * }
         */
        public static final long wiperStatusChange$offset() {
            return wiperStatusChange$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t wiperStatusChange
         * }
         */
        public static int wiperStatusChange(MemorySegment union) {
            return union.get(wiperStatusChange$LAYOUT, wiperStatusChange$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t wiperStatusChange
         * }
         */
        public static void wiperStatusChange(MemorySegment union, int fieldValue) {
            union.set(wiperStatusChange$LAYOUT, wiperStatusChange$OFFSET, fieldValue);
        }

        private static final OfInt lowSpeed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("lowSpeed"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t lowSpeed
         * }
         */
        public static final OfInt lowSpeed$layout() {
            return lowSpeed$LAYOUT;
        }

        private static final long lowSpeed$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t lowSpeed
         * }
         */
        public static final long lowSpeed$offset() {
            return lowSpeed$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t lowSpeed
         * }
         */
        public static int lowSpeed(MemorySegment union) {
            return union.get(lowSpeed$LAYOUT, lowSpeed$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t lowSpeed
         * }
         */
        public static void lowSpeed(MemorySegment union, int fieldValue) {
            union.set(lowSpeed$LAYOUT, lowSpeed$OFFSET, fieldValue);
        }

        private static final OfInt resumedSpeed$LAYOUT = (OfInt)$LAYOUT.select(groupElement("resumedSpeed"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t resumedSpeed
         * }
         */
        public static final OfInt resumedSpeed$layout() {
            return resumedSpeed$LAYOUT;
        }

        private static final long resumedSpeed$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t resumedSpeed
         * }
         */
        public static final long resumedSpeed$offset() {
            return resumedSpeed$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t resumedSpeed
         * }
         */
        public static int resumedSpeed(MemorySegment union) {
            return union.get(resumedSpeed$LAYOUT, resumedSpeed$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t resumedSpeed
         * }
         */
        public static void resumedSpeed(MemorySegment union, int fieldValue) {
            union.set(resumedSpeed$LAYOUT, resumedSpeed$OFFSET, fieldValue);
        }

        private static final OfInt vehEntrsExitsRegion$LAYOUT = (OfInt)$LAYOUT.select(groupElement("vehEntrsExitsRegion"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t vehEntrsExitsRegion
         * }
         */
        public static final OfInt vehEntrsExitsRegion$layout() {
            return vehEntrsExitsRegion$LAYOUT;
        }

        private static final long vehEntrsExitsRegion$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t vehEntrsExitsRegion
         * }
         */
        public static final long vehEntrsExitsRegion$offset() {
            return vehEntrsExitsRegion$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t vehEntrsExitsRegion
         * }
         */
        public static int vehEntrsExitsRegion(MemorySegment union) {
            return union.get(vehEntrsExitsRegion$LAYOUT, vehEntrsExitsRegion$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t vehEntrsExitsRegion
         * }
         */
        public static void vehEntrsExitsRegion(MemorySegment union, int fieldValue) {
            union.set(vehEntrsExitsRegion$LAYOUT, vehEntrsExitsRegion$OFFSET, fieldValue);
        }

        private static final OfInt emerVehDetect$LAYOUT = (OfInt)$LAYOUT.select(groupElement("emerVehDetect"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t emerVehDetect
         * }
         */
        public static final OfInt emerVehDetect$layout() {
            return emerVehDetect$LAYOUT;
        }

        private static final long emerVehDetect$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t emerVehDetect
         * }
         */
        public static final long emerVehDetect$offset() {
            return emerVehDetect$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t emerVehDetect
         * }
         */
        public static int emerVehDetect(MemorySegment union) {
            return union.get(emerVehDetect$LAYOUT, emerVehDetect$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t emerVehDetect
         * }
         */
        public static void emerVehDetect(MemorySegment union, int fieldValue) {
            union.set(emerVehDetect$LAYOUT, emerVehDetect$OFFSET, fieldValue);
        }

        private static final OfInt emerVehLightBar$LAYOUT = (OfInt)$LAYOUT.select(groupElement("emerVehLightBar"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t emerVehLightBar
         * }
         */
        public static final OfInt emerVehLightBar$layout() {
            return emerVehLightBar$LAYOUT;
        }

        private static final long emerVehLightBar$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t emerVehLightBar
         * }
         */
        public static final long emerVehLightBar$offset() {
            return emerVehLightBar$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t emerVehLightBar
         * }
         */
        public static int emerVehLightBar(MemorySegment union) {
            return union.get(emerVehLightBar$LAYOUT, emerVehLightBar$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t emerVehLightBar
         * }
         */
        public static void emerVehLightBar(MemorySegment union, int fieldValue) {
            union.set(emerVehLightBar$LAYOUT, emerVehLightBar$OFFSET, fieldValue);
        }

        private static final OfInt reqTspEvp$LAYOUT = (OfInt)$LAYOUT.select(groupElement("reqTspEvp"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t reqTspEvp
         * }
         */
        public static final OfInt reqTspEvp$layout() {
            return reqTspEvp$LAYOUT;
        }

        private static final long reqTspEvp$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t reqTspEvp
         * }
         */
        public static final long reqTspEvp$offset() {
            return reqTspEvp$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t reqTspEvp
         * }
         */
        public static int reqTspEvp(MemorySegment union) {
            return union.get(reqTspEvp$LAYOUT, reqTspEvp$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t reqTspEvp
         * }
         */
        public static void reqTspEvp(MemorySegment union, int fieldValue) {
            union.set(reqTspEvp$LAYOUT, reqTspEvp$OFFSET, fieldValue);
        }

        private static final OfInt transitVehPassCnt$LAYOUT = (OfInt)$LAYOUT.select(groupElement("transitVehPassCnt"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t transitVehPassCnt
         * }
         */
        public static final OfInt transitVehPassCnt$layout() {
            return transitVehPassCnt$LAYOUT;
        }

        private static final long transitVehPassCnt$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t transitVehPassCnt
         * }
         */
        public static final long transitVehPassCnt$offset() {
            return transitVehPassCnt$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t transitVehPassCnt
         * }
         */
        public static int transitVehPassCnt(MemorySegment union) {
            return union.get(transitVehPassCnt$LAYOUT, transitVehPassCnt$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t transitVehPassCnt
         * }
         */
        public static void transitVehPassCnt(MemorySegment union, int fieldValue) {
            union.set(transitVehPassCnt$LAYOUT, transitVehPassCnt$OFFSET, fieldValue);
        }

        private static final OfInt transitVehDoor$LAYOUT = (OfInt)$LAYOUT.select(groupElement("transitVehDoor"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t transitVehDoor
         * }
         */
        public static final OfInt transitVehDoor$layout() {
            return transitVehDoor$LAYOUT;
        }

        private static final long transitVehDoor$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t transitVehDoor
         * }
         */
        public static final long transitVehDoor$offset() {
            return transitVehDoor$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t transitVehDoor
         * }
         */
        public static int transitVehDoor(MemorySegment union) {
            return union.get(transitVehDoor$LAYOUT, transitVehDoor$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t transitVehDoor
         * }
         */
        public static void transitVehDoor(MemorySegment union, int fieldValue) {
            union.set(transitVehDoor$LAYOUT, transitVehDoor$OFFSET, fieldValue);
        }

        private static final OfInt v2xMsgRecption$LAYOUT = (OfInt)$LAYOUT.select(groupElement("v2xMsgRecption"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * NULL_t v2xMsgRecption
         * }
         */
        public static final OfInt v2xMsgRecption$layout() {
            return v2xMsgRecption$LAYOUT;
        }

        private static final long v2xMsgRecption$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * NULL_t v2xMsgRecption
         * }
         */
        public static final long v2xMsgRecption$offset() {
            return v2xMsgRecption$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * NULL_t v2xMsgRecption
         * }
         */
        public static int v2xMsgRecption(MemorySegment union) {
            return union.get(v2xMsgRecption$LAYOUT, v2xMsgRecption$OFFSET);
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * NULL_t v2xMsgRecption
         * }
         */
        public static void v2xMsgRecption(MemorySegment union, int fieldValue) {
            union.set(v2xMsgRecption$LAYOUT, v2xMsgRecption$OFFSET, fieldValue);
        }

        private static final GroupLayout driverAlertsAndWarnings$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("driverAlertsAndWarnings"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * RptDriverAlertsAndWarnings_t driverAlertsAndWarnings
         * }
         */
        public static final GroupLayout driverAlertsAndWarnings$layout() {
            return driverAlertsAndWarnings$LAYOUT;
        }

        private static final long driverAlertsAndWarnings$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * RptDriverAlertsAndWarnings_t driverAlertsAndWarnings
         * }
         */
        public static final long driverAlertsAndWarnings$offset() {
            return driverAlertsAndWarnings$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * RptDriverAlertsAndWarnings_t driverAlertsAndWarnings
         * }
         */
        public static MemorySegment driverAlertsAndWarnings(MemorySegment union) {
            return union.asSlice(driverAlertsAndWarnings$OFFSET, driverAlertsAndWarnings$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * RptDriverAlertsAndWarnings_t driverAlertsAndWarnings
         * }
         */
        public static void driverAlertsAndWarnings(MemorySegment union, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, union, driverAlertsAndWarnings$OFFSET, driverAlertsAndWarnings$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this union
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final GroupLayout choice$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("choice"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * union RptVehicleEvents_u choice
     * }
     */
    public static final GroupLayout choice$layout() {
        return choice$LAYOUT;
    }

    private static final long choice$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * union RptVehicleEvents_u choice
     * }
     */
    public static final long choice$offset() {
        return choice$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * union RptVehicleEvents_u choice
     * }
     */
    public static MemorySegment choice(MemorySegment struct) {
        return struct.asSlice(choice$OFFSET, choice$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * union RptVehicleEvents_u choice
     * }
     */
    public static void choice(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, choice$OFFSET, choice$LAYOUT.byteSize());
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

