// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct VehicleClassification {
 *     BasicVehicleClass_t *keyType;
 *     BasicVehicleRole_t *role;
 *     Iso3833VehicleType_t *iso3883;
 *     VehicleType_t *hpmsType;
 *     ITIS_VehicleGroupAffected_t *vehicleType;
 *     ITIS_IncidentResponseEquipment_t *responseEquip;
 *     ITIS_ResponderGroupAffected_t *responderType;
 *     FuelType_t *fuelType;
 *     struct VehicleClassification__regional {
 *         struct {
 *             struct Reg_VehicleClassification **array;
 *             int count;
 *             int size;
 *             void (*free)(struct Reg_VehicleClassification *);
 *         } list;
 *         asn_struct_ctx_t _asn_ctx;
 *     } *regional;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class VehicleClassification {

    VehicleClassification() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_POINTER.withName("keyType"),
        MessageFrame_h.C_POINTER.withName("role"),
        MessageFrame_h.C_POINTER.withName("iso3883"),
        MessageFrame_h.C_POINTER.withName("hpmsType"),
        MessageFrame_h.C_POINTER.withName("vehicleType"),
        MessageFrame_h.C_POINTER.withName("responseEquip"),
        MessageFrame_h.C_POINTER.withName("responderType"),
        MessageFrame_h.C_POINTER.withName("fuelType"),
        MessageFrame_h.C_POINTER.withName("regional"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("VehicleClassification");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout keyType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("keyType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BasicVehicleClass_t *keyType
     * }
     */
    public static final AddressLayout keyType$layout() {
        return keyType$LAYOUT;
    }

    private static final long keyType$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BasicVehicleClass_t *keyType
     * }
     */
    public static final long keyType$offset() {
        return keyType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BasicVehicleClass_t *keyType
     * }
     */
    public static MemorySegment keyType(MemorySegment struct) {
        return struct.get(keyType$LAYOUT, keyType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BasicVehicleClass_t *keyType
     * }
     */
    public static void keyType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(keyType$LAYOUT, keyType$OFFSET, fieldValue);
    }

    private static final AddressLayout role$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("role"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * BasicVehicleRole_t *role
     * }
     */
    public static final AddressLayout role$layout() {
        return role$LAYOUT;
    }

    private static final long role$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * BasicVehicleRole_t *role
     * }
     */
    public static final long role$offset() {
        return role$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * BasicVehicleRole_t *role
     * }
     */
    public static MemorySegment role(MemorySegment struct) {
        return struct.get(role$LAYOUT, role$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * BasicVehicleRole_t *role
     * }
     */
    public static void role(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(role$LAYOUT, role$OFFSET, fieldValue);
    }

    private static final AddressLayout iso3883$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("iso3883"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * Iso3833VehicleType_t *iso3883
     * }
     */
    public static final AddressLayout iso3883$layout() {
        return iso3883$LAYOUT;
    }

    private static final long iso3883$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * Iso3833VehicleType_t *iso3883
     * }
     */
    public static final long iso3883$offset() {
        return iso3883$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * Iso3833VehicleType_t *iso3883
     * }
     */
    public static MemorySegment iso3883(MemorySegment struct) {
        return struct.get(iso3883$LAYOUT, iso3883$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * Iso3833VehicleType_t *iso3883
     * }
     */
    public static void iso3883(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(iso3883$LAYOUT, iso3883$OFFSET, fieldValue);
    }

    private static final AddressLayout hpmsType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("hpmsType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * VehicleType_t *hpmsType
     * }
     */
    public static final AddressLayout hpmsType$layout() {
        return hpmsType$LAYOUT;
    }

    private static final long hpmsType$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * VehicleType_t *hpmsType
     * }
     */
    public static final long hpmsType$offset() {
        return hpmsType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * VehicleType_t *hpmsType
     * }
     */
    public static MemorySegment hpmsType(MemorySegment struct) {
        return struct.get(hpmsType$LAYOUT, hpmsType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * VehicleType_t *hpmsType
     * }
     */
    public static void hpmsType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(hpmsType$LAYOUT, hpmsType$OFFSET, fieldValue);
    }

    private static final AddressLayout vehicleType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("vehicleType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static final AddressLayout vehicleType$layout() {
        return vehicleType$LAYOUT;
    }

    private static final long vehicleType$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static final long vehicleType$offset() {
        return vehicleType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static MemorySegment vehicleType(MemorySegment struct) {
        return struct.get(vehicleType$LAYOUT, vehicleType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_VehicleGroupAffected_t *vehicleType
     * }
     */
    public static void vehicleType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(vehicleType$LAYOUT, vehicleType$OFFSET, fieldValue);
    }

    private static final AddressLayout responseEquip$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("responseEquip"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static final AddressLayout responseEquip$layout() {
        return responseEquip$LAYOUT;
    }

    private static final long responseEquip$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static final long responseEquip$offset() {
        return responseEquip$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static MemorySegment responseEquip(MemorySegment struct) {
        return struct.get(responseEquip$LAYOUT, responseEquip$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_IncidentResponseEquipment_t *responseEquip
     * }
     */
    public static void responseEquip(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(responseEquip$LAYOUT, responseEquip$OFFSET, fieldValue);
    }

    private static final AddressLayout responderType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("responderType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static final AddressLayout responderType$layout() {
        return responderType$LAYOUT;
    }

    private static final long responderType$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static final long responderType$offset() {
        return responderType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static MemorySegment responderType(MemorySegment struct) {
        return struct.get(responderType$LAYOUT, responderType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * ITIS_ResponderGroupAffected_t *responderType
     * }
     */
    public static void responderType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(responderType$LAYOUT, responderType$OFFSET, fieldValue);
    }

    private static final AddressLayout fuelType$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fuelType"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * FuelType_t *fuelType
     * }
     */
    public static final AddressLayout fuelType$layout() {
        return fuelType$LAYOUT;
    }

    private static final long fuelType$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * FuelType_t *fuelType
     * }
     */
    public static final long fuelType$offset() {
        return fuelType$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * FuelType_t *fuelType
     * }
     */
    public static MemorySegment fuelType(MemorySegment struct) {
        return struct.get(fuelType$LAYOUT, fuelType$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * FuelType_t *fuelType
     * }
     */
    public static void fuelType(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fuelType$LAYOUT, fuelType$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * struct VehicleClassification__regional {
     *     struct {
     *         struct Reg_VehicleClassification **array;
     *         int count;
     *         int size;
     *         void (*free)(struct Reg_VehicleClassification *);
     *     } list;
     *     asn_struct_ctx_t _asn_ctx;
     * }
     * }
     */
    public static class VehicleClassification__regional {

        VehicleClassification__regional() {
            // Should not be called directly
        }

        private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
            list.layout().withName("list"),
            asn_struct_ctx_s.layout().withName("_asn_ctx")
        ).withName("VehicleClassification__regional");

        /**
         * The layout of this struct
         */
        public static final GroupLayout layout() {
            return $LAYOUT;
        }

        /**
         * {@snippet lang=c :
         * struct {
         *     struct Reg_VehicleClassification **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_VehicleClassification *);
         * }
         * }
         */
        public static class list {

            list() {
                // Should not be called directly
            }

            private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
                MessageFrame_h.C_POINTER.withName("array"),
                MessageFrame_h.C_INT.withName("count"),
                MessageFrame_h.C_INT.withName("size"),
                MessageFrame_h.C_POINTER.withName("free")
            ).withName("$anon$45:3");

            /**
             * The layout of this struct
             */
            public static final GroupLayout layout() {
                return $LAYOUT;
            }

            private static final AddressLayout array$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("array"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * struct Reg_VehicleClassification **array
             * }
             */
            public static final AddressLayout array$layout() {
                return array$LAYOUT;
            }

            private static final long array$OFFSET = 0;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * struct Reg_VehicleClassification **array
             * }
             */
            public static final long array$offset() {
                return array$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * struct Reg_VehicleClassification **array
             * }
             */
            public static MemorySegment array(MemorySegment struct) {
                return struct.get(array$LAYOUT, array$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * struct Reg_VehicleClassification **array
             * }
             */
            public static void array(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(array$LAYOUT, array$OFFSET, fieldValue);
            }

            private static final OfInt count$LAYOUT = (OfInt)$LAYOUT.select(groupElement("count"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final OfInt count$layout() {
                return count$LAYOUT;
            }

            private static final long count$OFFSET = 8;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static final long count$offset() {
                return count$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static int count(MemorySegment struct) {
                return struct.get(count$LAYOUT, count$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int count
             * }
             */
            public static void count(MemorySegment struct, int fieldValue) {
                struct.set(count$LAYOUT, count$OFFSET, fieldValue);
            }

            private static final OfInt size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("size"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final OfInt size$layout() {
                return size$LAYOUT;
            }

            private static final long size$OFFSET = 12;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static final long size$offset() {
                return size$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static int size(MemorySegment struct) {
                return struct.get(size$LAYOUT, size$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * int size
             * }
             */
            public static void size(MemorySegment struct, int fieldValue) {
                struct.set(size$LAYOUT, size$OFFSET, fieldValue);
            }

            /**
             * {@snippet lang=c :
             * void (*free)(struct Reg_VehicleClassification *)
             * }
             */
            public static class free {

                free() {
                    // Should not be called directly
                }

                /**
                 * The function pointer signature, expressed as a functional interface
                 */
                public interface Function {
                    void apply(MemorySegment _x0);
                }

                private static final FunctionDescriptor $DESC = FunctionDescriptor.ofVoid(
                    MessageFrame_h.C_POINTER
                );

                /**
                 * The descriptor of this function pointer
                 */
                public static FunctionDescriptor descriptor() {
                    return $DESC;
                }

                private static final MethodHandle UP$MH = MessageFrame_h.upcallHandle(Function.class, "apply", $DESC);

                /**
                 * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
                 * The lifetime of the returned segment is managed by {@code arena}
                 */
                public static MemorySegment allocate(Function fi, Arena arena) {
                    return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
                }

                private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

                /**
                 * Invoke the upcall stub {@code funcPtr}, with given parameters
                 */
                public static void invoke(MemorySegment funcPtr,MemorySegment _x0) {
                    try {
                         DOWN$MH.invokeExact(funcPtr, _x0);
                    } catch (Throwable ex$) {
                        throw new AssertionError("should not reach here", ex$);
                    }
                }
            }

            private static final AddressLayout free$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("free"));

            /**
             * Layout for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_VehicleClassification *)
             * }
             */
            public static final AddressLayout free$layout() {
                return free$LAYOUT;
            }

            private static final long free$OFFSET = 16;

            /**
             * Offset for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_VehicleClassification *)
             * }
             */
            public static final long free$offset() {
                return free$OFFSET;
            }

            /**
             * Getter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_VehicleClassification *)
             * }
             */
            public static MemorySegment free(MemorySegment struct) {
                return struct.get(free$LAYOUT, free$OFFSET);
            }

            /**
             * Setter for field:
             * {@snippet lang=c :
             * void (*free)(struct Reg_VehicleClassification *)
             * }
             */
            public static void free(MemorySegment struct, MemorySegment fieldValue) {
                struct.set(free$LAYOUT, free$OFFSET, fieldValue);
            }

            /**
             * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
             * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
             */
            public static MemorySegment asSlice(MemorySegment array, long index) {
                return array.asSlice(layout().byteSize() * index);
            }

            /**
             * The size (in bytes) of this struct
             */
            public static long sizeof() { return layout().byteSize(); }

            /**
             * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
             */
            public static MemorySegment allocate(SegmentAllocator allocator) {
                return allocator.allocate(layout());
            }

            /**
             * Allocate an array of size {@code elementCount} using {@code allocator}.
             * The returned segment has size {@code elementCount * layout().byteSize()}.
             */
            public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
                return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
                return reinterpret(addr, 1, arena, cleanup);
            }

            /**
             * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
             * The returned segment has size {@code elementCount * layout().byteSize()}
             */
            public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
                return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
            }
        }

        private static final GroupLayout list$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("list"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_VehicleClassification **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_VehicleClassification *);
         * } list
         * }
         */
        public static final GroupLayout list$layout() {
            return list$LAYOUT;
        }

        private static final long list$OFFSET = 0;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_VehicleClassification **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_VehicleClassification *);
         * } list
         * }
         */
        public static final long list$offset() {
            return list$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_VehicleClassification **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_VehicleClassification *);
         * } list
         * }
         */
        public static MemorySegment list(MemorySegment struct) {
            return struct.asSlice(list$OFFSET, list$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * struct {
         *     struct Reg_VehicleClassification **array;
         *     int count;
         *     int size;
         *     void (*free)(struct Reg_VehicleClassification *);
         * } list
         * }
         */
        public static void list(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, list$OFFSET, list$LAYOUT.byteSize());
        }

        private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

        /**
         * Layout for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final GroupLayout _asn_ctx$layout() {
            return _asn_ctx$LAYOUT;
        }

        private static final long _asn_ctx$OFFSET = 24;

        /**
         * Offset for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static final long _asn_ctx$offset() {
            return _asn_ctx$OFFSET;
        }

        /**
         * Getter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static MemorySegment _asn_ctx(MemorySegment struct) {
            return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Setter for field:
         * {@snippet lang=c :
         * asn_struct_ctx_t _asn_ctx
         * }
         */
        public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
            MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
        }

        /**
         * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
         * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
         */
        public static MemorySegment asSlice(MemorySegment array, long index) {
            return array.asSlice(layout().byteSize() * index);
        }

        /**
         * The size (in bytes) of this struct
         */
        public static long sizeof() { return layout().byteSize(); }

        /**
         * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
         */
        public static MemorySegment allocate(SegmentAllocator allocator) {
            return allocator.allocate(layout());
        }

        /**
         * Allocate an array of size {@code elementCount} using {@code allocator}.
         * The returned segment has size {@code elementCount * layout().byteSize()}.
         */
        public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
            return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
            return reinterpret(addr, 1, arena, cleanup);
        }

        /**
         * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
         * The returned segment has size {@code elementCount * layout().byteSize()}
         */
        public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
            return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
        }
    }

    private static final AddressLayout regional$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("regional"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct VehicleClassification__regional *regional
     * }
     */
    public static final AddressLayout regional$layout() {
        return regional$LAYOUT;
    }

    private static final long regional$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct VehicleClassification__regional *regional
     * }
     */
    public static final long regional$offset() {
        return regional$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct VehicleClassification__regional *regional
     * }
     */
    public static MemorySegment regional(MemorySegment struct) {
        return struct.get(regional$LAYOUT, regional$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct VehicleClassification__regional *regional
     * }
     */
    public static void regional(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(regional$LAYOUT, regional$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 72;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
