// Generated by jextract

package j2735_2024_MessageFrame;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct WeatherReport {
 *     EssPrecipYesNo_t isRaining;
 *     EssPrecipRate_t *rainRate;
 *     EssPrecipSituation_t *precipSituation;
 *     EssSolarRadiation_t *solarRadiation;
 *     EssMobileFriction_t *friction;
 *     CoefficientOfFriction_t *roadFriction;
 *     asn_struct_ctx_t _asn_ctx;
 * }
 * }
 */
public class WeatherReport {

    WeatherReport() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        MessageFrame_h.C_LONG.withName("isRaining"),
        MessageFrame_h.C_POINTER.withName("rainRate"),
        MessageFrame_h.C_POINTER.withName("precipSituation"),
        MessageFrame_h.C_POINTER.withName("solarRadiation"),
        MessageFrame_h.C_POINTER.withName("friction"),
        MessageFrame_h.C_POINTER.withName("roadFriction"),
        asn_struct_ctx_s.layout().withName("_asn_ctx")
    ).withName("WeatherReport");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong isRaining$LAYOUT = (OfLong)$LAYOUT.select(groupElement("isRaining"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EssPrecipYesNo_t isRaining
     * }
     */
    public static final OfLong isRaining$layout() {
        return isRaining$LAYOUT;
    }

    private static final long isRaining$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EssPrecipYesNo_t isRaining
     * }
     */
    public static final long isRaining$offset() {
        return isRaining$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EssPrecipYesNo_t isRaining
     * }
     */
    public static long isRaining(MemorySegment struct) {
        return struct.get(isRaining$LAYOUT, isRaining$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EssPrecipYesNo_t isRaining
     * }
     */
    public static void isRaining(MemorySegment struct, long fieldValue) {
        struct.set(isRaining$LAYOUT, isRaining$OFFSET, fieldValue);
    }

    private static final AddressLayout rainRate$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rainRate"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EssPrecipRate_t *rainRate
     * }
     */
    public static final AddressLayout rainRate$layout() {
        return rainRate$LAYOUT;
    }

    private static final long rainRate$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EssPrecipRate_t *rainRate
     * }
     */
    public static final long rainRate$offset() {
        return rainRate$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EssPrecipRate_t *rainRate
     * }
     */
    public static MemorySegment rainRate(MemorySegment struct) {
        return struct.get(rainRate$LAYOUT, rainRate$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EssPrecipRate_t *rainRate
     * }
     */
    public static void rainRate(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rainRate$LAYOUT, rainRate$OFFSET, fieldValue);
    }

    private static final AddressLayout precipSituation$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("precipSituation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EssPrecipSituation_t *precipSituation
     * }
     */
    public static final AddressLayout precipSituation$layout() {
        return precipSituation$LAYOUT;
    }

    private static final long precipSituation$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EssPrecipSituation_t *precipSituation
     * }
     */
    public static final long precipSituation$offset() {
        return precipSituation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EssPrecipSituation_t *precipSituation
     * }
     */
    public static MemorySegment precipSituation(MemorySegment struct) {
        return struct.get(precipSituation$LAYOUT, precipSituation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EssPrecipSituation_t *precipSituation
     * }
     */
    public static void precipSituation(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(precipSituation$LAYOUT, precipSituation$OFFSET, fieldValue);
    }

    private static final AddressLayout solarRadiation$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("solarRadiation"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EssSolarRadiation_t *solarRadiation
     * }
     */
    public static final AddressLayout solarRadiation$layout() {
        return solarRadiation$LAYOUT;
    }

    private static final long solarRadiation$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EssSolarRadiation_t *solarRadiation
     * }
     */
    public static final long solarRadiation$offset() {
        return solarRadiation$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EssSolarRadiation_t *solarRadiation
     * }
     */
    public static MemorySegment solarRadiation(MemorySegment struct) {
        return struct.get(solarRadiation$LAYOUT, solarRadiation$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EssSolarRadiation_t *solarRadiation
     * }
     */
    public static void solarRadiation(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(solarRadiation$LAYOUT, solarRadiation$OFFSET, fieldValue);
    }

    private static final AddressLayout friction$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("friction"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * EssMobileFriction_t *friction
     * }
     */
    public static final AddressLayout friction$layout() {
        return friction$LAYOUT;
    }

    private static final long friction$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * EssMobileFriction_t *friction
     * }
     */
    public static final long friction$offset() {
        return friction$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * EssMobileFriction_t *friction
     * }
     */
    public static MemorySegment friction(MemorySegment struct) {
        return struct.get(friction$LAYOUT, friction$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * EssMobileFriction_t *friction
     * }
     */
    public static void friction(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(friction$LAYOUT, friction$OFFSET, fieldValue);
    }

    private static final AddressLayout roadFriction$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("roadFriction"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * CoefficientOfFriction_t *roadFriction
     * }
     */
    public static final AddressLayout roadFriction$layout() {
        return roadFriction$LAYOUT;
    }

    private static final long roadFriction$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * CoefficientOfFriction_t *roadFriction
     * }
     */
    public static final long roadFriction$offset() {
        return roadFriction$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * CoefficientOfFriction_t *roadFriction
     * }
     */
    public static MemorySegment roadFriction(MemorySegment struct) {
        return struct.get(roadFriction$LAYOUT, roadFriction$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * CoefficientOfFriction_t *roadFriction
     * }
     */
    public static void roadFriction(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(roadFriction$LAYOUT, roadFriction$OFFSET, fieldValue);
    }

    private static final GroupLayout _asn_ctx$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("_asn_ctx"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final GroupLayout _asn_ctx$layout() {
        return _asn_ctx$LAYOUT;
    }

    private static final long _asn_ctx$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static final long _asn_ctx$offset() {
        return _asn_ctx$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static MemorySegment _asn_ctx(MemorySegment struct) {
        return struct.asSlice(_asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * asn_struct_ctx_t _asn_ctx
     * }
     */
    public static void _asn_ctx(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, _asn_ctx$OFFSET, _asn_ctx$LAYOUT.byteSize());
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

